{
  "url": "https://docs.netskope.com/en/about-the-admin-console",
  "title": "About the Admin Console - Netskope Knowledge Portal",
  "content": "The Admin Console provides a central interface for configuring the settings of the Netskope Security Platform in addition to performing a variety of functions, like creating reports to managing incidents. To begin, log in your Netskope Tenant. There are two primary areas of the Admin Console: Settings and Functions. Settings Settings are accessible by clicking Settings in the bottom of the left nav on the Home page. This opens the Settings page, which provides general information. The Settings page left nav panel contains these links: Admin Add admins to the management console, define and assign roles, and configure SSO and IP whitelist setting for the management console itself. Security Cloud Platform Configure the optional on-premises infrastructure components of the Netskope Active Platform in addition to managing client traffic steering deployments, reverse proxy configurations, and exceptions. Risk Insights Upload logs to your Netskope tenant. You can uploads logs directly via the UI or via SFTP. There is also a custom log parser. API-enabled Protection Configure API Introspection to connect to your IT-led, sanctioned cloud services. Threat Protection Options for configuring your Introspection-configured cloud services for malware protection in addition to configuring integration with Carbon Black. Forensics Enable forensics and setup a forensics profile. Manage Settings for traffic steering, custom apps, certificate-pinned apps, and device classification. Tools Create templates, configure directory tools, REST API, and clear events. Functions The Netskope Admin Console provides access to a number of functions. Functions are presented in the left nav panel. Dashboard (Home) Assess cloud risk by viewing information about applications, sites, users, total bytes, and total sessions. Customize this dashboard to display the information you want. Incidents The Incidents dashboard displays data loss prevention (DLP), anomalies, compromised credentials, malware, malicious sites, quarantine, and legal hold information. API-enabled Protection The API-enabled Protection dashboard provides visibility into file exposure for your sanctioned cloud services that have been configured with API Introspection. Assess your risk and optionally take action directly from the dashboard. Policies Implement inline and API Introspection policies, encryption, DLP, and threat protection. Customize policies with profiles and templates. Skope IT Use Skope IT, Netskope’s event-by-event monitoring tool, to view cloud usage events, manage alerts, interface with quarantine, legal hold, and threat threat protection dashboards, and manage incidents. Cloud Confidence Index Peruse the database of thousands of cloud services that have been researched and the enterprise-readiness assessed. Filter view by discovered apps or drill into the details of a specific cloud service. Advanced Analytics The Advanced Analytics dashboard displays summaries, and enables you to in-depth analysis and create custom reports.",
  "content_length": 3025,
  "crawl_timestamp": 1750779847.28785
}