{
  "url": "https://docs.netskope.com/en/create-a-new-publisher",
  "title": "Create a New Publisher - Netskope Knowledge Portal",
  "content": "Create a Publisher to deploy on your network and use with a private app. The token generated in this procedure is used to deploy the Publisher, so be sure to make a copy. Auto-Update profiles have been add to the Publisher settings. If you have not yet created an Auto-Update profile, you can choose to use the default profile, or go to Configure Publisher Auto-Updates to create one. Go to Settings > Security Cloud Platform > Publishers . Click New Publisher . Enter a Publisher name (like AWS US-WestWing publisher ), and then select an Auto-Update profile. Click Save & Generate Token . Click Copy to get the registration token. Click Done . After deploying the Publisher, return to the Publisher page to verify the status is Connected . The Publishers page shows how many Publishers have been created, each Publisher’s name, status, version, CN, and number of connected apps. To customize the columns shown on the page, click the gear icon in the table header and check the columns you want to see. To edit the name, delete, or update a Publisher, click the menu icon in the row a Publisher is listed. You can search for and filter Publishers listed on the page based on search criteria. If a filter has an arrow, you can select predefined search criteria, or search by entering specific criteria. Click Add Filter to view and select a predefined filter, or search for a Publisher, Update Profile, and Version. Configure a Publisher in AWS The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher in Amazon Web Services. This section explains how to create a Publisher instance in Amazon Web Services. Knowledge of the Netskope UI and Amazon Web Services are required, along with: A Netskope Tenant. A copy of your Publisher registration token. An Amazon Web Services account. To access the AMI file from the Publisher page in the Netskope UI, go to Settings > Security Cloud Platform > Publishers and click Publisher AMI . Perform these steps in the AWS console. Launch an EC2 Instance Sign in to your Amazon Web Services (AWS) console. Click Services > Find services . Search for EC2 and then select EC2 . Click Instances in the left sidebar menu. Click Launch Instance . Choose an Amazon Machine Image (AMI) Click AWS Marketplace in the left sidebar menu. Enter Netskope in the search bar. Netskope Private Access Publisher should appear in the search results. Click Select . Choose an Instance Type Select t3.medium as the instance type. Click Next: Configure Instance Details . Configure Instance Details The token you copied from the Netskope UI is needed to complete these steps. Enter 1 in the Number of instances field. Select the VPC where the application you want to publish via Netskope is deployed in the Network field. Keep the default values for the remaining fields. Click Advanced Details to expand this section. In the User data section, select the As text option. Enter the Netskope Publisher registration token into the User Data text field. Add a Name Tag Adding a name tag is optional, but doing so will make it easier to identify your Netskope Publisher EC2 instance. Click the Add Tags tab, near the top of the page. Click Add Tag . Enter Name in the Key field. Enter AWS US-WestWing publisher in the Value field. Click Review and Launch . Review Instance Launch Review the information in the AMI Details Instance Type sections. Click Launch . Select or create a key pair. This key pair is used to ssh in to the Publisher VM. Password-based authentication is by default disabled on the AWS publishers. Click Launch Instances . Review the information on the Launch Status page. Click View Instances . View Instances You should now see a new EC2 instance with the name AWS US-WestWing publisher (if you completed the Add a Name Tag steps). AWS typically takes several minutes to launch EC2 instance and run status checks. Wait until your Instance State is Running and Status Checks have passed. Register the Publisher Note Registering the Publisher is optional and only required if the Publisher token was not provided during the initial Publisher instance deployment. SSH into the publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting . Configure a Publisher in Azure The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher in Azure. This topic explains how to create a Publisher instance in Azure. Knowledge of the Netskope UI and Azure are required, along with: A Netskope Tenant A copy of your Publisher registration token An Azure account. Note Azure Publishers require 30GB HDD instead of the standard 8GB. Perform these steps in the Azure console. Create a Virtual Machine (VM) Go to Azure Marketplace and search for Netskope Private Access Publisher . Click Create . Select Netskope Private Access Publisher from the drop-down menu. Click Basics . Select or edit the Resource group and virtual machine, if required. While creating the VM, the Username field automatically adds azureuser by default. Change the Username to ubuntu to ensure that you log in to the correct virtual machine. Copy and paste your public SSH key under SSH public key. If you do not have a public SSH key, select Generate new key pair . This key pair is used to ssh in to the Publisher VM. Password-based authentication is by default disabled on the Azure publishers. Select SSH from the Select public inbound ports dropdown menu. Click Next:Disks . Customize according to the desired disk settings or use the default settings. Click Next: Networking . Review your networking settings. Select SSH from the Select public inbound ports dropdown menu. Click Review + Create and analyze the virtual machine settings. Click Create . Wait until the deployment completes. Open an SSH Session Click Virtual machines . Select the newly created VM. Find a public IP address. On your computer terminal execute: ssh -i <your_private_ssh.key> ubuntu@ <ipaddress> . Register the Publisher Note Registering the Publisher is optional and only required if the Publisher token was not provided during the initial Publisher instance deployment. SSH into the publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting . Configure a Publisher in GCP The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher in Google Cloud Platform. This topic explains how to create a Publisher instance in Google Cloud Platform Storage. Knowledge of the Netskope UI and Google Cloud Platform are required, along with: A Netskope Tenant A copy of your Publisher registration token A Google Cloud Platform account with a working VPC setup and API permissions. Important Ensure your /tmp folder has a 777 permission for successful Publisher deployments and OS updates. Perform these steps in the Google Cloud Platform console. Log in to Google Cloud Platform at https://console.cloud.google.com/ . Click the menu icon in the top left and select Compute Engine and then VM instances . Click Create Instance . Enter a name for the instance, like netskope-publisher . Select a Region and Zone. For testing purposes this can be anything. In a production environment, you want to enter the region and zone where the applications reside. Configure the instance memory and CPU settings (2 core, 4 GB memory is the recommended setting, but for testing purposes a smaller machine will work). Click Change under Boot disk. Select Ubuntu as the Operating System and Ubuntu 22.04 LTS as the Version. Leave the Boot disk type and Size as the defaults. Click Select . Note: Steps 10-13 are optional if no other route to the internet is available. Click Management, security, disks, networking, sole tenancy Click Networking. Click the pencil icon to edit the network interface. Select your Network, Subnetwork, and specify an Ephemeral external IP. Click Create to start the instance creation. Once the instance is available, connect to it by clicking SSH under the Compute Engine page. Run the following command in the SSH session to download and install the necessary components for the Publisher. This may take about 10 minutes. curl https://s3-us-west-2.amazonaws.com/publisher.netskope.com/latest/generic/bootstrap.sh | sudo bash; sudo su - $USER; exit At the end of this process, you have a fully functional Netskope Publisher and can register it with Netskope. Register the Publisher SSH into the publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting . Configure a Publisher in VMWare ESXi The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher in VMWare ESXi. This topic explains how to create a Publisher instance in VMWare ESXi. Knowledge of the Netskope UI and VMWare ESXi are required, along with: A Netskope Tenant A copy of your Publisher registration token A VMWare ESXi account, Version 7 Update 2 or later. To access the OVA from the Publisher page in the Netskope UI, go to Settings > Security Cloud Platform > Publishers and click Publisher OVA to download the Publisher OVA file. The OVA file is needed to create a ESXi-based Publisher. Note If you want to validate the integrity of the OVA, the SHA hash can be found in the Publisher Release Notes . Perform these steps in the VMWare ESXi console. Log in to your ESXi instance and click Virtual Machines . Click Create/Register VM . For Select Creation Type, select Deploy a virtual machine from an OVF or OVA file , and then click Next . For Select OVF and VMDK files, enter a name for the VM, drag and drop the OVA from Netskope, and then click Next . For Select Storage, keep the default settings and click Next . For Deployment Options, select your default network, and then click Next . For Ready to Complete, review the settings to confirm, and then click Finish . If a Publisher needs additional interfaces, proceed to step 8. To add another interface, click on the VM you just created and then click Edit Settings . Click Add Network Adapter , and then click Save . Register the Publisher SSH into the publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . Execute the following command only if the Publisher is hosted inside China and needs to connect to a NewEdge DC inside China: sudo touch resources/.prc_dp . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting . Configure a Publisher in Hyper-V The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher in Hyper-V. This topic explains how to create a Publisher instance in Hyper-V. Knowledge of the Netskope UI and Hyper-V are required, along with: A Netskope Tenant A copy of your Publisher registration token A Hyper-V account. To access the VHDX file from the Publisher page in the Netskope UI, go to Settings > Security Cloud Platform > Publishers and click Publisher VHDX . Note If you want to validate the integrity of the VHDX, the SHA hash can be found in the Publisher Release Notes . Perform these steps in the Hyper-V console. Launch the Microsoft Hyper-V Manager and select the Action New > Virtual Machine… . Enter a VM Name (like NPA Publisher), optionally an installation location, and then click Next . Tip Name the Publisher to describe its location and/or application use. Leave Generation 1 selected and click Next . Specify the amount of memory for the NPA Publisher (4096 is recommended for most use cases) and click Next . Select a network adapter to attach the NPA Publisher that has Internet access and click Next . Select Use an existing virtual hard disk and then Browse to the downloaded VHDX file. When finished, click Next . Confirm the Hyper-V Wizard configuration options and click Finish . Now you can Start your NPA Publisher in Hyper-V. Get the IP address provided by the Hyper-V Manager to SSH into a Publisher for Network Settings. Register the Publisher SSH into the publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . Execute the following command only if the Publisher is hosted inside China and needs to connect to a NewEdge DC inside China: sudo touch resources/.prc_dp . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting . Configure a Publisher on a Ubuntu Installed System The Netskope Publisher allows for zero trust network access to applications and hosts in your public cloud or private data center. This includes the ability to leverage a Publisher on a standalone installation of Ubuntu OS. Any Ubuntu server, whether on-premises or in a public cloud, and whether physical or virtual, that satisfies the requirements is supported. Note Before you deploy a Publisher, make sure to bump up the MTU to 1500 bytes. This topic explains how to create a Publisher instance on a Ubuntu OS. Knowledge of the Netskope UI is required, along with: A Netskope Tenant. A copy of your Publisher registration token. A Ubuntu 20 LTS installed system with following configuration: Meets Publisher Requirements .Have a non-root user with sudo permission to install the publisher via script. ImportantEnsure your /tmp folder has a 777 permission for successful Publisher deployments and OS updates. Run the following command in the non-root SSH session on your Ubuntu OS to download and install the necessary components for the Publisher. This may take about 10 minutes. curl https://s3-us-west-2.amazonaws.com/publisher.netskope.com/latest/generic/bootstrap.sh | sudo bash; sudo su - $USER; exit At the end of this process, you have a fully functional Netskope Publisher and can register it with Netskope. Note During auto-update of this Publisher, Netskope will update the Publisher and make an attempt to update the Ubuntu system. Kernel updates should be carried out by the system administrator. For more information, go to Publisher Auto-Update . Register the Publisher SSH into the Publisher (default username: ubuntu , default password: ubuntu ). When prompted, change your password. After you change it, the system auto-disconnects your SSH session, so you will need to reconnect and log in with their new password before proceeding. SSH into the Publisher (default username: ubuntu , default password: ubuntu ). Note In the event of a password change, the new password must meet the following minimum requirements: Minimum password length must be 14 characters. Must contain one upper case letter. Must contain one lower case letter. Must contain one digit (number). Must contain one non-alphanumeric character. Cannot be a palindrome. When prompted for a menu choice, select Register . When requested, enter the Netskope registration token, and then click Enter . You can also enter the token with this command: sudo ./npa_publisher_wizard -token <TOKEN> . Go to Settings > Security Cloud Platform > Publishers in your Netskope tenant and confirm your Publisher has a Connected status. If not, go to Publisher Logs for Troubleshooting .",
  "content_length": 20098,
  "crawl_timestamp": 1750781054.71922
}