{
  "url": "https://docs.netskope.com/en/configure-netskope-client-settings/",
  "title": "Configure Netskope Client Settings - Netskope Knowledge Portal",
  "content": "The Netskope Client has a range of settings that are controlled centrally by administrators; for example: Tamperproofing settings, Software Update settings, and on-premises detection. Settings profiles can be applied globally or targeted towards specific groups of users. Just like the Steering Profile Configuration, there is a default settings configuration that is used as a fallback or in the absence of any other profiles. Go to Settings > Security Cloud Platform > Devices , and click Client Configurations . The Devices page shows a list of all devices that have been deployed with the Netskope Client. Create or Edit a Client Configuration Profile Click on the Default tenant configuration to edit the default configuration profile, or New Client Configuration to create a new one. Tip If you plan to enable tamperproofing (like disabling the ability for users to turn off the Netskope Client), you may wish to create a second configuration profile that targets your your IT team (or the team that manages your Netskope deployment), and allow then to disable the Client for troubleshooting purposes. We recommended that you leave most of the settings under the Traffic Steering tab as the default, unless you have a specific need or reason to change them. For full details on each option available under the Client Configuration settings, go here: Configuring the Netskope Client Set Software Update Preferences The Install & Troubleshoot tab allows you to control how and when the Netskope Client is automatically updated as releases are made available. The Netskope Client should be set to automatically update to the latest Golden Release as best practice. Tip We strongly recommend that you set the Client to upgrade automatically to the Latest Golden Release. Golden Releases run a few versions behind the latest release, but are more thoroughly tested and supported for longer. Important Changing the Log Level (under Advanced ) to Debug will negatively impact performance and throughput of the Netskope Client. This setting should only be used at the direction of Netskope Support for troubleshooting purposes. Set Tamperproof Preferences The Tamperproof tab allows control over whether end-users can freely enable/disable/stop the Netskope Client. Tamperproof settings can be used to prevent users from disabling the Netskope Client. Tip For general end-users, we recommend to prevent the disabling of the Netskope Client, disable the Allow disabling of Clients option. You should also enable password protection for Client uninstallation and service stop, which can be helpful in environments where users still have local administrator rights on their machines. Important No software tamperproofing is 100% effective if the end-user has local administrator privileges on their machine (as this provides them with ultimate control over the device). We recommend that you disable administrator privileges on corporate managed machines where possible.",
  "content_length": 2965,
  "crawl_timestamp": 1750780174.218787
}