{
  "url": "https://docs.netskope.com/en/cloud-exchange-supported-integrations",
  "title": "Cloud Exchange Supported Integrations - Netskope Knowledge Portal",
  "content": "A module-specific write-access user can create, enable, modify, or delete plugins. This section describes the 3rd-party plugins supported by Netskope Cloud Exchange. In addition to the Netskope plugins, Cloud Exchange works with the following plugins which, as of version 5.1, are found in the Github repository and are pulled down by Cloud Exchange during initial installation, whenever the Cloud Exchange service is started or stopped, and whenever a write-access user responds to an updates are available prompt with a command to retrieve the new or updated plugins. Tip Plugins with Beta beside the name are Best Effort plugins, for which there are no video or guide available, just a README file. Log Shipper ArcSight : Send Netskope Events, Alerts, and Web Transaction Logs in raw JSON format or Syslog CEF with custom field mappings. AWS CloudTrail Lake : This plugin is used to deliver events and alerts to AWS CloudTrail Lake. To configure this plugin, the IAM User or Role used needs to have an IAM policy with the following permissions: cloudtrail:(CreateEventDataStore, UpdateEventDataStore, DeleteEventDataStore, ListEventDataStores, RestoreEventDataStore, GetEventDataStore, StartQuery, ListQueries, CancelQuery, DescribeQuery, GetQueryResults), cloudtrail-data:(PutAuditEvents), iam:(ListRoles, GetRolePolicy, GetUser, PassRole). Refer the plugin user guide for more details. AWS S3 Events, Alerts : This plugin is used to deliver events and alerts data to the AWS S3 platform. To access the plugin, you would need the credentials of AWS S3 instance. Note: This plugin is designed to send raw data to S3. AWS S3 WebTx : This plugin is used to deliver web transactions data to AWS S3 platform. To access the plugin, you would need the credentials of AWS S3 instance. AWS Security Lake : This plugin is used to deliver alerts, events and web transactions data to Amazon Security Lake platform. To access the plugin, you would need the credentials of Amazon Security Lake instance. AWS SQS : This plugin supports ingestion of Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, CTEP, UBA) data to the AWS SQS platform. To access the plugin, you would need the credentials of AWS. Note: This plugin supports ingestion in JSON format on the AWS SQS Queue. AT&T AlienVault (using the default Syslog plugin): This plugin is used to ingest data to AlienVault platform. To access the plugin, you would need the credentials of AlienVault platform . Bitsight ThirdPartyTrust : This plugin ingests data to the BitSight platform to enable TPRM automation and perform enhanced controls. To configure the plugin, log in to BitSight platform and obtain an API key. CrowdStrike LogScale : This plugin is used to deliver alerts, events, and webtx data. This plugin only supports sharing raw JSON data to CrowdStrike LogScale HTTP Event Collector. CrowdStrike Next-Gen SIEM : This plugin supports the ingestion of Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, and CTEP) and Events (Page, Application, Audit, Infrastructure, Network, Incident, and Endpoint) to HEC / HTTP Event Connector on CrowdStrike Next-Gen SIEM platform. This plugin only supports sharing raw JSON data to CrowdStrike Next-Gen SIEM. Datadog : This plugin supports the ingestion of Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, and CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident, and Endpoint), WebTx (Compressed), and Logs (Debug, Information, Error, and Warning) into the Datadog platform. It supports the ingestion of logs in both JSON and CEF formats. Elastic : This plugin is used to ingest Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP) and Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint) in ECS (Elastic Common Schema) and JSON formats to the Elastic platform. For details on Elastic Agent deployment, refer to the documentation . FortiSIEM : This plugin supports ingestion of Alerts (DLP, Malware, Policy, Compromised Credentials, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, CTEP, UBA), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint), Webtx and Logs (Debug, Information, Error, Warning), it only supports the ingestion of JSON-formatted logs on FortiSIEM platform. Google Cloud SCC : This plugin is used to ingest alerts and events data to Google Cloud SCC. The plugin supports sharing of findings data. The plugin requires credentials for a GCP service account to function. Google GCP Storage : This plugin is used to deliver web transactions data to GCP platform. To access the plugin, you would need the Service Account in GCP. Google Chronicle : This plugin is used to deliver alerts and events data to Google Chronicle platform. The plugin supports sharing of UDM formatted data. The required API keys are linked to customers and are provided by your Google Chronicle representative. IBM QRadar : This plugin is used to ingest data to QRadar platform. To access the plugin, you would need the credentials of QRadar platform . Kafka : This plugin ingests logs to Kafka Topic. This plugin ingests Netskope Alerts, Events, and web transaction logs in CEF and JSON format from the Netskope Tenant into the Kafka topic on the Kafka server/cluster. The plugin will act as a producer to publish the message to the Kafka topic. Local Export : Utilize this plugin to transfer web transaction data to a designated location on your local storage. LogRhythm : This plugin is used to ingest data to LogRhythm platform. To access the plugin, you would need the credentials of LogRhythm platform . Microsoft Azure Event Hubs : This plugin supports ingestion of Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint) and WebTx data. The data will be sent to the Microsoft Azure Event Hubs. This plugin supports ingestion in both CEF and JSON format. Microsoft Azure Sentinel : This plugin is designed for ingesting Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, CTEP, UBA), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint) and WebTx data (uncompressed) into the Microsoft Azure Sentinel, it only supports the ingestion of JSON-formatted logs. You need the Log Analytics Workspace on the Microsoft Azure platform to access the plugin. Microsoft Azure Monitor : This plugin is designed for ingesting Alerts and Events data into the Microsoft Azure Monitor Log Analytics Workspace ‘basic’ table. You would need the credentials on the Microsoft Azure platform to access the plugin. Microsoft Azure Cloud Storage : This plugin is used to deliver web transactions data to Microsoft Azure platform. Microsoft Defender for Cloud Apps : Send Netskope Events (Page, Application) in CEF format from the Netskope Tenant to Microsoft Defender for Cloud Apps using Cloud Exchange via the Microsoft Defender for Cloud Apps plugin. The plugin doesn’t support ingesting data in JSON format. Microsoft Azure Event Hubs : This plugin supports ingestion of Alerts (DLP, Malware, Policy, Compromised Credential, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint) and WebTx data. The data will be sent to the Microsoft Azure Event Hubs. This plugin supports ingestion in both CEF and JSON format. Rapid7 : This plugin supports ingestion of Alerts (Anomaly, DLP, Malware, Policy, Compromised Credential, Legal Hold, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident), WebTx and Logs (Debug, Information, Error, Warning). The data will be ingested in SIEM platform. This plugin supports ingestion in CEF and JSON format. To access the plugin, you would need the credentials of Rapid7 platform. Scality : This plugin is used to deliver Alerts (Anomaly, DLP, Malware, Policy, Compromised Credential, Legal Hold, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA and CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident and Endpoint) and WebTx logs to the Scality platform. To access the plugin, you would need the credentials of Scality. Note: This plugin is designed to send raw (JSON) logs to Scality. Secureworks : This plugin is used to ingest data to SIEM platform. To access the plugin, you would need the credentials of SIEM platform . Solarwinds (using the default Syslog plugin): This plugin is used to ingest data to SIEM platform. To access the plugin, you would need the credentials of SIEM platform . Syslog : This plugin supports ingestion of Alerts (Anomaly, DLP, Malware, Policy, Compromised Credential, Legal Hold, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint), WebTx and Logs (Debug, Information, Error, Warning). The data will be ingested in SIEM platform. This plugin supports ingestion in CEF and JSON format. Syslog and WebTx with Splunk : Send Alerts (Anomaly, DLP, Malware, Policy, Compromised Credential, Legal Hold, Malsite, Quarantine, Remediation, Security Assessment, Watchlist, UBA, CTEP), Events (Page, Application, Audit, Infrastructure, Network, Incident, Endpoint), WebTx and Logs (Debug, Information, Error, Warning). The data will be ingested in the SIEM platform. This plugin supports ingestion in CEF and JSON format. WebTx : This plugin facilitates the subscription to web transaction data from Netskope. This plugin supports web transaction data of types format 1, format 2 and format 3. Ticket Orchestrator Azure Service Bus : This plugin is used to send messages in the Queues available on the Azure Service Bus platform. This plugin only supports adding(creating) messages in the Queues, the plugin does not support updating or syncing messages in Queues. HaloITSM : This plugin is used to create tickets on the HaloITSM platform. Only supports ticket creation and ticket status syncing. Note: Updating tickets on HaloITSM platform is not supported. Ivanti : This plugin is used to create incidents on the Ivanti platform. It also supports updating incidents and syncing their status. Jira : This plugin is used to create tickets for selected Jira projects on the Jira Cloud Platform. It also supports updating tickets and syncing their status. Microsoft Teams : This plugin is used to send message notifications to the Microsoft Teams channel. It does not support updating messages or syncing status. Notifier (Slack/Gmail/Email) : Send notifications to various platforms: Email (SMTP), Gitter, Gmail, Hipchat, Join, Mailgun, Pagerduty, PopcornNotify, Pushbullet, Pushover, SimplePush, Slack (Webhooks), StatusPage, Telegram, Twilio, Zulip. Okta Webhook : Enables automated synchronization of user data and events. This integration can help detect special security events and can trigger special actions on the user’s end with the Okta Workflows. ServiceNow : Create incidents on the Incident > All page, security incidents on the Security Incident > Incidents > Show All Incidents page, GRC issues on the Policy and Compliance > Issues > All Issues page, and records on the Custom Table record page of the ServiceNow platform. It also supports updating incidents/issues and syncing their status. This plugin is not the same as ServiceNow’s DLP Incident Response product, nor does this plugin work with that solution. Webhook : This plugin is used to send JSON data to publicly accessible webhook. BMC Helix ITSM ( Beta ): This plugin is used to create incidents on the BMC Helix ITSM platform. Threat Exchange Anomali ThreatStream XDR : The Anomali ThreatStream XDR plugin is used to fetch the indicators of type URL, IP (IPv4), Domain, IPv6, SHA256 and MD5 from the Observables on Anomali ThreatStream (XDR). This plugin supports sharing MD5, SHA256, URL, Domain, IPv4 and IPv6 to Observables on the Anomali ThreatStream (XDR) platform using the Share Indicators action. API Source : The REST API Plugin should be used to receive data via RESTful APIs. This plugin cannot pull data from the source. This plugin can be configured to share data with other threat sources. AWS GuardDuty : AWS GuardDuty plugin fetches SHA256, URLs(IPv4 and Domain) indicators from GuardDuty platform. Carbon Black : The Carbon Black plugin fetches IoCs of the type of SHA256 from Alerts page of Cloud NGAV and Cloud EDR. The plugin supports sharing Indicators of the type of URL (DNS, IPv4, and IPv6), SHA256, and MD5 to Carbon Black via the ThreatHunter API on the Watchlists->Reports page. To access the plugin, you would need API credentials with RBAC permissions to READ “org.alerts” and CREATE, READ and UPDATE “org.feeds”. Commvault : This plugin shares URLs(backup anomaly insights) with Netskope (Cloud Exchange) to inform organizations when suspicious behaviour and data changes are occurring within backup content using Commvault REST APIs. The plugin also supports the sharing of URLs(Anamoly Detections) from Netskope (Cloud Exchange) to Commvault. CrowdStrike : This plugin fetches Threat IoCs of type Hash (MD5 and SHA256), Domains, IPv4, IPv6 from CrowdStrike’s Endpoint detections and IOC management page. This plugin supports sharing the Threat IoCs to CrowdStrike’s IOC management page and can perform Isolate/Remediate actions for hosts. Only file hash IOCs activate prevention; Domain, IPv4, IPv6 don’t trigger prevention in CrowdStrike. Sharing URL information from Netskope CE to CrowdStrike is not recommended, as CrowdStrike currently only supports ingesting SHA256, MD5, Domain, IPv4, and IPv6.To access the plugin, you would need the API credentials. Cybereason : This plugin is used to fetch File hashes (MD5 and SHA256), and URLs (IPv4, IPv6, Domains) from the Cybereason’s security-profile > reputations-list page. This plugin can also share the indicator Hash (MD5, SHA256), and URLs(IPv4, IPv6, Domains) to the Cybereason’s security-profile > reputations-list page. To access the plugin, you would need the API credentials. Digital Shadow : This plugin is used to fetch impersonating domains from Digital Shadows. ExtraHop Reveal(x) 360 : The ExtraHop Reveal(x) 360 plugin fetches an offender’s IP Address and Hostname as URLs in Cloud Exchange. The Plugin does not support sharing indicators to ExtraHop Reveal(x) 360 platform. Feedly : The Feedly plugin fetches IoCs of the type SHA256 Hash, MD5 Hash, URLs, Domains and IP Addresses from Feedly Stream. This plugin does not support sharing of Indicators to Feedly. Note: Feedly plugin fetches indicators in the MISP format from Feedly Stream. Github : GitHub DLP plugin is used to fetch files from the owner’s GitHub repositories. MD5 hashes of files reported to Netskope CTE as indicators. HarfangLab : This plugin is used to share indicators of type MD5, SHA256 and URLs (IPv4, IPv6, Domains, URLs) to IoC List (Threat Intelligence > IoC List) on HarfangLab. This plugin does not support pulling of indicators. Illumio : This plugin is used to pull IOCs of the type URLs (IP Addresses and Hostname) from Workloads on the Illumio PCE based on the configured Label scope. This plugin does not support sharing of indicators to Illumio platform. Infoblox TIDE : This plugin is used to fetch the indicators of type Host, IPv4, IPv6, URL and Hash (MD5 and SHA256) from the Monitor > Research > Active Indicators page in Infoblox. This plugin supports sharing indicators of type Host, IPv4, IPv6, URL and Hash (MD5 and SHA256) to the Monitor > Research > Active Indicators page in Infoblox. This plugin supports retraction for the IoCs pulled from Infoblox. Maltiverse : This plugin is used to fetch indicators of type SHA256, IP Addresses (IPv4 and IPv6), URLs and Hostnames from Intelligence > Feeds from Maltiverse platform. This plugin does not support pushing indicators to Maltiverse. Mandiant : The Google Mandiant plugin fetches IoCs of the type of URL (URL, FQDN, IPv4, and IPv6), and MD5 from the Google Mandiant platform. This plugin does not support sharing of indicators. You need a Google Mandiant key ID and key secret to access the plugin. Microsoft Office 365 Endpoints : This plugin is used to fetch URLs from Microsoft Office 365 Endpoint. This plugin does not support sharing of indicators to Microsoft Office 365 Endpoint. Microsoft Defender for Cloud Apps : This plugin is used to fetch unsanctioned data from the Microsoft Defender for Cloud Apps Platform. This plugin does not support sharing of Indicators to Microsoft Defender for Cloud Apps Platform. Microsoft Defender for Endpoints : This plugin is used to pull and push IoC data from Microsoft Defender for Endpoint. Mimecast : This plugin is used to fetch the indicators of type URL from Services > URL Protection > Logs page, SHA256 and MD5 from the Mimecast. This plugin also support sharing the URL indicators to Services > URL Protection > URL Tools > Managed URLS page using Create Managed URL action and sharing of SHA256 and MD5 indicators using Perform Operation action to the Mimecast. To access the plugin, you would need an API application on Mimecast and user credentials. MISP : This plugin is used to fetch event attributes from MISP (Malware Information Sharing Platform) and extract indicators of type SHA256, MD5, URL, Domain, IP (IPv4 and IPv6) and Hostname from them. It can also share the indicators of type SHA256, MD5, URL, Domain (Domain and FQDN), Hostname, IP (IPv4 and IPv6) as attributes to MISP Custom Events. To get required details for creating a new configuration, navigate to https://<misp-url>/events/automation. Note: The Source IP (ip-src) and Destination IP (ip-dst) will be stored as either IPv4 or IPv6 in Cloud Exchange. Source IP Port (ip-src port), Destination IP Port (ip-dst port), and Hostname Port (hostname port) will be stored as URLs in Cloud Exchange. For Domain IP, the domain and IP (either IPv4 or IPv6) will be split and stored as separate IoCs in Cloud Exchange. OpenCTI : This plugin fetches indicators of type URL, IPv4, Domain, IPv6, SHA256 and MD5 from the Observables on OpenCTI. This plugin supports sharing MD5, SHA256, URL, Domain, IPv4 and IPv6 to Observables on the OpenCTI platform using the Add Indicators action. Palo Alto Networks Cortex XDR : This plugin fetches indicators of type SHA256 and MD5 from Palo Alto Networks Cortex XDR and supports the sharing of SHA256, MD5, and URL (Domain and IPv4) indicators to the Palo Alto Networks Cortex XDR platform. Palo Alto Networks Panorama : This plugin is used to fetches information about domains, IP addresses, file hashes (SHA256) from Wildfire logs, and URLs from URL Filtering logs. Proofpoint : The Proofpoint plugin fetches malicious file hashes and URLs from several types of TAP (Targeted Attack Protection) events. This plugin does not support sharing of Indicators to Proofpoint. To access the plugin, you would need Proofpoint username and password having Proofpoint API access. Rubrik : This plugin is used to push IoCs of type MD5, and SHA256 to the Threat Hunt page, and doesn’t support pulling of IOCs from Rubrik. This plugin supports performing ‘Start Threat Hunt’ action. SecLytics : This plugin will collect URL, IP, and CIDR indicators from the SecLytics BulkAPI. Secureworks Taegis : This plugin is used to pull IoCs of type Domain and IP Address from Secureworks Taegis platform. This plugin does not support sharing of Indicators or performing any actions. Refer the Secureworks [documentation](https://docs.ctpx.secureworks.com/apis/api_authenticate/#part-1-create-client-credentials) to create client credentials. SecurityScorecard : CTE Plugin for SecurityScorecard. SentinelOne : The SentinelOne plugin fetches SHA256 and MD5 file hash from Incidents page of SentinelOne platform from provided site. This plugin shares SHA256, MD5, URL, IPv4, IPv6 and DNS(Domain, Hostname, and FQDN) to Threat Intelligence. Note: The indicators shared via Netskope CE won’t be shown to SentinelOne. One can verify the shared IoCs via endpoint **<SentinelOne Base URL>/web/api/v2.1/threat-intelligence/iocs** ServiceNow Threat Intelligence : ServiceNow Threat Intelligence application has Observables table that stores the indicators observed across the enterprise. This plugin provides mechanism to query the Observables(sn_ti_observables) table for MD5, SHA256 and URL type of observables and sharing new observables. This plugin requires ServiceNow account details which has access to Threat Intelligence application. Skyhigh : This plugin is used to fetch URLs, FQDN, and IP Addresses from the Skyhigh CASB Published URL. This plugin does not support pushing indicators to Skyhigh. Sophos : This plugin is used to fetch SHA256 type of threat indicators from Threat Graphs under Threat Analysis Center from Sophos Central platform. This plugin does not support sharing of indicators to Sophos Central platform. STIX/TAXII : The STIX/TAXII plugin polls TAXII feeds and extracts observables from them. This plugin does not support sharing of indicators to TAXII feeds. ThreatConnect : The ThreatConnect plugin is used to pull IoCs of type File (MD5 and SHA256), URL, Host and Address (IPv4 and IPv6) from the Indicators under the Intelligence Requirements from ThreatConnect. This plugin also supports sharing File (MD5 and SHA256), URL, Host and Address (IPv4 and IPv6) to the ThreatConnect’s Group under the Intelligence Requirements using the Add to Group action. ThreatQ : Fetch the indicators of type URL, IP (IPv4, IPv6), FQDN, SHA256 and MD5 from the ThreatQ Library > Indicators page on the ThreatQ platform. This plugin does not support sharing of indicators to the ThreatQ platform. Trellix : Trellix plugin fetches Threat IOCs (SHA256, Domain, IP Address and URLs) from Trellix EPO. The plugin does not support sharing indicators to Trellix EPO. Trend Micro : This plugin is used to fetch Domains, File SHA-256, IP address (IPv4, IPv6) and URLs from the Suspicious Object List. This plugin allows sharing of Domains, File SHA-256, IP address (IPv4, IPv6) and URLs to Trend Vision One’s Suspicious Object List or Exception List. For suspicious objects added through third-party intelligence and manual operations, there is a maximum limit for each object type. For more information, refer to Trend Vision One API documentation. Web Page IoC Scraper : This plugin is used to pull IOCs of type URL, Domain, IPv4, IPv6, MD5 and SHA256 from any public website. This plugin does not support sharing of IOCs or performing any actions. Vectra AI : This plugin is used to pull IoCs of the type URLs (IPv4 Addresses and Domains) from the Detections page in Vectra AI. This plugin does not support sharing of indicators to Vectra AI. Abnormal Security ( Beta ): Fetch the indicators of type SHA256, MD5, URL, Domain and IPv4 from the Abnormal Security platform. This plugin does not support sharing of indicators to the Abnormal Security platform. Cynet ( Beta ): Cynet plugin fetches Threat IOCs (SHA256, Domain, IP Address and URLs) from Cynet Alerts and also supports Remediation Action on File (SHA256). Microsoft Defender Threat Intelligence ( Beta ): This plugin is used to pull indicators of type URLs (Hostnames and IP Addresses) from Microsoft Defender Threat Intelligence platform from the Intelligence Profiles. The Plugin does not support sharing indicators to Microsoft Defender Threat Intelligence platform. Recorded Future ( Beta ): This plugin is used to pull indicators of type URL, Domain, IP Addresses (IPv4, IPv6) and Hash (MD5 and SHA256) from the risk list of Recorded Future platform. This plugin does not support sharing of indicators to Recorded Future. Symantec EDR ( Beta ): The Symantec EDR (On Prem) plugin fetches IoCs of the type of URL (Domain, IPv4, IPv6), and SHA256 from the Symantec EDR platform. This plugin does not support sharing of indicators. Risk Exchange Starting with Cloud Exchange 5.1.0, the two User Risk Exchange and Application Risk Exchange workflows have been combined within the Risk Exchange v1.0.0 module. The following integrations are supported in the new Risk Exchange module. AWS Access Verified : This plugin is used to fetch users from the log streams present inside a CloudWatch log group attached with verified access instance. This plugin does not support performing action on the users. Bitsight : This plugin is used to fetch companies and their respective Security Rating from the Bitsight platform. It retrieves first-party companies from the Security Performance Management > Organization > My Company List page and third-party companies from the Continuous Monitoring > Portfolio Risk > Companies List page. This plugin also support performing Add company to tier and Remove company from tier actions on Bitsight. CrowdStrike Falcon Cloud Security : The CrowdStrike Falcon Cloud Security plugin fetches users from the Cloud Indicators of attack (IOAs) page and cloud workloads (applications) from the Indicators of misconfiguration (IOMs) page. Both pages are available under Cloud Security > Cloud Posture in the CrowdStrike tenant. This plugin does not support any actions on users or applications in CrowdStrike Falcon Cloud Security. CrowdStrike Falcon Identity Protection : This plugin fetches users and their respective scores from Identity Protection > Users page of CrowdStrike Falcon Identity Protection. This plugin does not support any actions to be performed on users. CrowdStrike : This plugin fetches hosts and their respective ZTA scores from the Host Setup and Management > Host Management page on the CrowdStrike tenant. It also supports the Put RTR Script action on hosts. CyberArk : CyberArk plugin fetches users and their risk levels from the Core Services > Users page of the Identity Administration portal. To fetch the risk levels, you must have the Behavioral Analytics portal enabled for their CyberArk tenant. This plugin also performs action on CyberArk users like – Add users to a role and Remove users from a role. Elastic : This plugin is used to fetch users available at Security > Explore > Users > All users page and their respective risk scores available at Security > Explore > Users > User risk page from the configured Elastic instance. This plugin does not support performing any actions on users. ExtraHop Reveal(x) 360 : This plugin is used to fetch Cloud Workloads (Devices) from the Detections of the ExtraHop Reveal(x) 360 platform. It does not support performing any actions on Cloud Workloads (Devices) in ExtraHop Reveal(x) 360. HPE Aruba Networking Central : This plugin is used to fetch Wired and Wireless clients data from Aruba Networking Central of HPE Greenlake. It retrieves the clients from the Aruba Networking Central > Clients page. This plugin also supports performing Add client to blacklist, Remove client from blacklist, and Disconnect client from networking device actions on Aruba Networking Central Illumio : This plugin is used to fetch hosts in llumio at Servers and Endpoints > Workloads . This plugin does not support any actions on hosts. Infoblox SOC Insights : This plugin is used to fetch devices from the Monitor > Reports > Security > Insights page of the Infoblox SOC Insights. This plugin does not support performing action on the devices on Infoblox SOC Insights. Jamf : This plugin is used to fetch devices in Jamf Security Cloud at the Devices > Manage page. It also supports performing the Override Risk Level and Revert Risk Level action on devices. KnowBe4 : This plugin is used to fetch users from the PAB User Activity page of the KnowBe4 platform. The PAB User Activity page can be found in KnowBe4 at Account Settings > Account Integrations > Phish Alert > See PAB User Activity . The plugin does not support performing any actions on users in KnowBe4. LDAP : LDAP plugin fetches users from provided Search Base path. It also supports Add to group and Remove from group action on users. Microsoft Defender for Endpoint : This plugin is used to fetch device data from Assets > Devices and users data from Assets > Devices > Select device > Overview > Logged on users pages of the Microsoft Defender for Endpoint platform. This plugin supports performing actions such as Isolate device, Undo isolation, Restrict app execution, Remove app restriction, Run antivirus scan, Offboard device and Collect investigation package actions on the devices, and doesn’t support any action on the users. Microsoft Entra ID : This plugin is used to fetch risky users from Identity > Protection > Identity Protection > Risky users , and applications from Identity > Applications > App registrations page of the Microsoft Entra ID platform. This plugin supports performing actions such as Add to group, Remove from group, and Confirm compromised actions on the users, and doesn’t support any action on the applications. Mimecast : This plugin is used to fetch users on the Awareness Training > Reporting and Insights > Risk Center > View Details page of Mimecast platform. This plugin supports performing actions such as Add to group, Remove from group and No action on Mimecast users. Okta : The Okta Plugin fetches users from the Directory > People page), their Risk Levels and Applications (Applications page) from the Okta platform. This plugin also performs action on Okta users like – Add users to a group, Remove users from a group, Upsert User Risk and Push risk score (using Security Events Provider). The Push risk score enables action via group membership changes used in Okta Authentication Policies when Netskope identifies a risky user and to share risk signals with Okta Identity Threat Protection. Palo Alto Networks Cortex XDR : This plugin fetches Endpoints and Users data from Palo Alto Networks Cortex XDR platform. This plugin retrieves the endpoints from the Endpoint > All Endpoints page. This plugin also supports Isolate Endpoint, Un-Isolate Endpoint, Run Scan on Endpoint, Cancel Running Scan on Endpoint actions in the Palo Alto Networks Cortex XDR platform. ServiceNow : This plugin supports performing the Share application data action to User Administration > Companies page of the ServiceNow platform. This plugin does not support fetching data from the ServiceNow platform. StealthMole : This plugin is used to fetch users based on searched domains available on UB under Create New Case in the StealthMole platform. This plugin does not support performing any actions on users on the StealthMole platform Tanium : This plugin is used to fetch devices from Home > Total Endpoints and their respective risk scores from Modules > Benchmark > Tanium Risk Score 2.0 > Endpoints by Risk Score page of the Tanium platform. This plugin does not support performing any actions on devices. Zylo : This plugin is used to fetch applications from the Zylo platform > Inventory > Applications page. The plugin does not support performing any actions on applications in Zylo. Forescout ( Beta ): The Forescout plugin fetches hosts and their risk information from All Hosts page of Forescout. It does not support any actions on Forescout. Infoblox BloxOne ( Beta ): This plugin is used to fetch applications data from Monitor > Reports > Security > Application Discovery > All Applications and devices from Configure > Security > Endpoints page of the Infoblox BloxOne platform. This plugin supports performing Update application status action on the applications and doesn’t support any action on the devices. LDAP : LDAP plugin fetches users from provided Search Base path. It also supports Add to group and Remove from group action on users. Proofpoint: This plugin is used to fetch the attack index of users from TAP Dashboard > People page of the Proofpoint instance using the VAP module. The plugin does not support performing any actions on users in Proofpoint. Tanium : This plugin is used to fetch devices from Home > Total Endpoints and their respective risk scores from the Modules > Benchmark > Tanium Risk Score 2.0 > Endpoints by Risk Score page in the Tanium platform. This plugin does not support performing any actions on devices. Wiz : This plugin is used to fetch applications from the Wiz platform. This plugin does not support sharing applications or pushing applications to Wiz. User Risk Exchange These integrations are for the original version of Risk Exchange, where User Risk Exchange and Application Risk Exchange were separate workflows within the Risk Exchange module. Starting with Cloud Exchange 5.1.0, the two workflows have been combined within the Risk Exchange v1.0.0 module. Azure AD : Fetch users and their respective scores from Microsoft Azure AD, and add or remove users from Microsoft Azure AD groups. BeyondCorp : Fetch user scores from BeyondCorp, and add or remove users from BeyondCorp groups. CrowdStrike : Fetch Host IDs and their risk scores from CrowdStrike’s platform to Cloud Exchange, and performs a Put RTR Script action on the host machine based on the Host scores. CrowdStrike Falcon Identity Protection : Fetch user risk scores from CrowdStrike Falcon Identity Protection, and add or remove users from CrowdStrike Falcon Identity Protection groups. CyberArk : Use to add or remove a CyberArk user to the CyberArk Roles. Elastic : Fetch users available on the Security > Explore > Users > All users page, and their respective risk scores available on the Security > Explore > Users > User risk page, from your Elastic instance. KnowBe4 (Security Advisor) : Fetch Behaviour score of users from Security Advisor. Okta : Add or remove users from Okta groups. Actions such as Add to Group, Remove from Group, Push Risk Scores, and No Actions can be performed on the users. The Push risk score enables actions via group membership changes used in Okta Authentication Policies when Netskope identifies a risky user, and to share risk signals with Okta Identity Threat Protection. Mimecast (Training Awareness safe score) : Fetch User Risk Scores from the Mimecast platform. This plugin supports performing actions on the users, such as Add to Group, Remove from Group, and No Action. Proofpoint : Fetch attack index of users from Proofpoint using the VAP module. LDAP : Perform operations like add to group and remove from the group on users. Application Risk Exchange These integrations are for the original version of Risk Exchange, where User Risk Exchange and Application Risk Exchange were separate workflows within the Risk Exchange module. Starting with Cloud Exchange 5.1.0, the two workflows have been combined within the Risk Exchange v1.0.0 module. Viso Trust : Send application risk scores (CCI) to Viso Trust and creates the relationships in the Viso Trust platform by grouping the applications together based on vendors. ServiceNow : Send application risk scores (CCI) to ServiceNow. Bitsight : Send the application data of Netskope tenants to Monitored Vendors for risk analysis. This plugin requires Bitsight account details, which has access to Monitored Vendors. Upload a Custom Plugin You can upload new plugins. After creating your custom plugin, follow these steps to upload your new plugin. Go to Settings and click Plugins . Click Add new Plugin , locate the ZIP or tar file for your custom plugin, and then click Upload . After successful validation, the newly added plugin is available under the supported plugins list for this CE instance only. Uploaded plugins are stored in the host file system. If the core docker container is upgraded or reset, all your uploaded plugins will still remain with all the configurations. Use this template to create a plugin user guide. Search and Filter the Plugin List On the Plugins page there’s an option to search via plugin name.",
  "content_length": 36183,
  "crawl_timestamp": 1750780315.423965
}