{
  "url": "https://docs.netskope.com/en/casb-api-billable-user-calculation",
  "title": "CASB API Billable User Calculation - Netskope Knowledge Portal",
  "content": "With the new usage reporting feature for Classic and Next Generation API Data Protection, you can now gain detailed visibility into their usage across all supported SaaS applications. This report helps you understand how billable users are calculated for each SaaS app, ensuring transparency and accuracy in billing. How to Access the Usage Reporting UI To view the API Data Protection usage on the Netskope tenant UI, follow the steps below: This is an opt-in feature. To enable this on your tenant, talk to your Netskope sales representative. Log in to your Netskope tenant UI. Navigate to Settings > Administration > CASB API Usage On the CASB API Usage page, you can view billable user count categorized by app name and instance. The table includes the name of the SaaS app, instance name, platform i.e., Next Generation or classic, and the number of billable users.You can export the list too. To do so, click the Export button at the top-right of the table. You can select the number of rows. The report name is auto-generated, however, you can edit the name. Then, click Export . You can download the file as a .csv . You can download the billable user count for an individual Saas app too. To do so, click the ellipsis ( ⋯ ) > Download user list . You can download the file as a .csv . For SaaS applications, if the number of billable users exceeds 1 million, Netskope recommends using a text editor or Google Sheets to open the .csv file. This recommendation is due to a limitation in Numbers for Mac and Microsoft Excel, which supports a maximum of 1 million records per sheet. Billable User Count Calculation Methodology The table below summarizes the billable user logic and specific calculation methodology for each supported application. Definitions: Active user: A user with active access who can log in and engage with the application’s content. Suspended user: The user does not have access to the app and only administrators have access to their data. However, the suspended users’ associated data can still be used for scanning and exposure calculation. Saas App Name User Type Accounted For Billing External User Included In Billing? Special Note Atlassian Confluence Active users Internal users only - Box Active + suspended users Internal users only (employee + service account) Box enables the creation of “app users,” which function as service accounts. Since Netskope processes notifications generated by these accounts, the associated activity contributes to the customer's billable usage. Cisco Webex Active users only Internal users only - Citrix ShareFile Active + suspended users Internal users only Citrix ShareFile charges for all user licenses, whether the users are active or suspended. Suspended users cannot access the app, and only administrators can access their data. However, data associated with suspended users remains available for scanning and exposure calculation. Dropbox Active + suspended users Internal users only A suspended user may own certain files, which can still be collaborated by other users. Next Generation API Data Protection will inspect these files whenever changes are made. Egnyte Active + suspended users Internal + external users A suspended user may own certain files, which can still be collaborated by other users. Next Generation API Data Protection will inspect these files whenever changes are made. There are three types of users: administrator, power user, and standard user. Standard users are external to the organization, such as vendors or partners. Any modifications to content accessible by these users will be processed by Next Generation API Data Protection. GitHub Active users only Internal + external users A suspended user has their access temporarily restricted, but their account and data remain intact and available for scanning. Adding an external collaborator to a private or internal repository uses one of your paid licenses, increasing your billing count. Google Drive Active + suspended users Internal users only Both active and suspended users are counted for Google Drive because data associated with suspended users is still scanned during retroactive scans. Administrators may choose to delete suspended users to remove them from Netskope’s billable user list and to reduce licensing costs from Google. Gmail/Calendar Active users only Internal users only - Microsoft 365 OneDrive Active + suspended users Internal users only Total billable users = Total valid internal users Important Notes: Netskope counts only the number of unique user GUIDs, not user emails. A single user may have multiple emails or aliases, so billing is based solely on unique user GUIDs. Netskope does not include SharePoint service plans when calculating billable users for OneDrive. Internal users are determined by Microsoft’s internal attribute, specifically: userType set to Member . The billable user count for Microsoft 365 OneDrive on Classic API Data Protection may appear lower due to legacy calculation methods. For accurate licensing data, please refer to the numbers reported in the Next Generation API Data Protection platform. Microsoft 365 Outlook Active users only Internal users only Total billable users = Total valid internal users Important Notes: Netskope counts only the number of unique user GUIDs, not user emails. A single user may have multiple emails or aliases, so billing is based solely on unique user GUIDs. Suspended users are not included because Next Generation API Data Protection does not offer retroactive scans to scan suspended users’ mailboxes. Internal users are determined by Microsoft’s internal attribute, specifically: userType set to Member . The billable user count for Microsoft 365 Outlook on Classic API Data Protection may appear lower due to legacy calculation methods. For accurate licensing data, please refer to the numbers reported in the Next Generation API Data Protection platform. Microsoft 365 SharePoint Active + suspended users Internal users only Total billable users = Total valid internal users Important Notes: Netskope counts only the number of unique user GUIDs, not user emails. A single user may have multiple emails or aliases, so billing is based solely on unique user GUIDs. Netskope does not include OneDrive or Teams service plans when calculating billable users for SharePoint. Internal users are determined by Microsoft’s internal attribute, specifically: userType set to Member . The billable user count for Microsoft 365 SharePoint on Classic API Data Protection may appear lower due to legacy calculation methods. For accurate licensing data, please refer to the numbers reported in the Next Generation API Data Protection platform. Microsoft 365 Teams Active + suspended users Internal users only Total billable users = Total valid internal users Important Notes: Netskope counts only the number of unique user GUIDs, not user emails. A single user may have multiple emails or aliases, so billing is based solely on unique user GUIDs. Internal users are determined by Microsoft’s internal attribute, specifically: userType set to Member . The billable user count for Microsoft 365 Teams on Classic API Data Protection may appear lower due to legacy calculation methods. For accurate licensing data, please refer to the numbers reported in the Next Generation API Data Protection platform. Salesforce Active + suspended users Internal + external users Salesforce charges customers based on the total number of licenses purchased, regardless of whether the users are active or suspended. From a Salesforce perspective, active + suspended users include the following user types: Standard: This user type also includes Salesforce Platform and Salesforce Platform One user licenses. PowerPartner: User whose access is limited because he or she is a partner and typically accesses the application through a partner portal or community. CsnOnly: user whose access to the application is limited to Chatter. This user type includes Chatter Free and Chatter moderator users. ServiceNow Active + suspended users Internal users only Both active and suspended users are counted because data associated with suspended users is still scanned for exposure calculation. Slack Enterprise Active users only Internal users only Total billable users = Total valid internal users + Total valid guest users Workday Active users only Internal users only Active & internal users that have access to Workday drive and can modify the content are included as part of total billable users. Zoom Active users only Internal users only - Have a question around the billable user count? Talk to your Netskope sales representative.",
  "content_length": 8656,
  "crawl_timestamp": 1750780765.677375
}