{
  "url": "https://docs.netskope.com/en/chrome-extension-support-for-user-notifications",
  "title": "Chrome Extension Support For User Notifications - Netskope Knowledge Portal",
  "content": "User notification templates enable you to block a user action and/or send an alert to the user. These templates can be customized to provide specific information and options in an alert or block notification. You can provide a justification dropdown list for your users and also display a description box to provide a justification. Optionally, you can make the justification text optional. To learn more, view User Notification Template . This is currently a Beta feature. Contact your sales representative or Netskope Support to enable this feature for your tenant. Currently, user notifications for Real-time protection policies rely mainly on the Netskope Client app to provide a seamless user experience for platforms such as Windows, macOS, and Linux. For ChromeOS, it can either use Netskope Client app for Android or Chrome extension along with Netskope Cloud Explicit Proxy. Chrome extensions are widely used as it can be seamlessly integrated with Google Workspace and simplifies the deployment of Network traffic steering configuration including CA certificates. Now Netskope supports Chrome extensions for user notifications without which the network traffic steering can fallback to the default setting: Block . Providing user notifications can help users understand the reason for blocking access to a specific SaaS application. Configure Netskope Chrome Extensions You can configure Netskope Chrome Extensions using one of the following: Using deployment tool like Google Workspace Manually through the Chrome Browser Using Google Workspace One Apply Netskope Chrome extension to use explicit proxy to steer SWG / CASB traffic from managed Chromebooks. To learn more, view Explicit Proxy for Chromebooks . Prerequisites: Download certificates from Netskope tenants and install them in Google Workspace ONE . Set Proxy mode to allow user configuration . You can push the Netskope Chrome extension through Google Workspace Admin console and pre-provision necessary configuration. To learn more, view Configuring Chrome Extension Using Google Workspace . Manual Configuration Of Chrome Extension to Chrome Browser Go to Chrome Web Store, search for Netskope Chrome Extension . Click Add to Chrome and pin it to your browser. Click the extension icon and enter your tenant ID. Click Set . Create a Policy User Notification Template(Optional) Log into Netskope tenant. Go to Policies > Templates > User Notification . Click Add Template > Cloud Apps & Web . It opens a new window: Create User Notification Template: Cloud Apps & Web . Enter these parameters: Template Name: Enter a name for this type of notification. Logo (Optional) : To add your company logo to the notification, select Create New from the Company Logo dropdown list and click Select File. Select your logo file, and then click Upload. Choose a size, and then stripe color if desired. Stripe Color: Change the color of the message text by entering a hex code. Title: Enter a description for this notification. Message: Enter an explanation for why the user cannot access the blocked Cloud app. Subtitle: Optional. Footer Message: Optional. Action Button: Leave the default button label, or create a new one. Show Justification Option: Select this option if you want to display Justify Usage and Report False Positive options on the user coaching notification screen. Show Justification Box: Select this option if you want to display the text screen where the user can enter the justification after selecting Justification options. There are options to set the template as the default, and also delete a language under Localization, at the bottom of the dialog box. In Action Buttons , select one of the options: Block User Alert Select appropriate actions that you want to display according to Block and User Alert . Enter the text to display on the Acknowledge button if you select Block. Enter the text to display on the Stop and Proceed buttons. Click Save . Limitations Chrome Extension supports only v1 notifications. Do not support Redirect end users to the following URL automatically. Do not support localization. Create a Real-Time Notification Template Policies are defined using a set of variables. These variables define the criteria for detecting policy violations. Use real-time policies to create rules for certain actions such as login attempt, edit, and so on. If a user attempts any of the actions configured in Real-time policy, the webUI displays a notification message that restricts permission to perform that action. The user needs to then provide a justification as to why it is important to perform that action. For example, you can create user notifications to display whenever a user attempts to login to Dropbox application. Refer to Create a Real-Time Protection Policy to understand the instructions to create a policy. You can select Login Attempt in the Activities field and add the notification templates in the Profile and Action fields. User Notifications For The End-User Once the policy is set and the user attempts to log into the application, the user coaching notification screen is displayed on the screen. Here, you can perform either one of the following actions: Click Proceed after adding a justification to proceed further with the application. Click Stop to cancel this action and you are not allowed to access the application.",
  "content_length": 5353,
  "crawl_timestamp": 1750780591.078178
}