{
  "url": "https://docs.netskope.com/en/create-a-real-time-protection-policy-for-private-apps",
  "title": "Create a Real-time Protection Policy for Private Apps - Netskope Knowledge Portal",
  "content": "Private apps are not steered by default, which means by default private applications are never accessible to end-users, and they also will not receive a user notification about this. The end-user’s steering profile needs to be updated to include the private apps required for the User (Group/OU), and a matching real-time policy must exist if no discovery is configured for the user. Policies are required to log events and enable access to Users, Groups, or OUs. Use Real-time Protection policies to: Grant access to a private app for users, groups, or OUs, based on Operating System, Access Method, and/or Device Classification. Block access and notify the user(s) why access is denied. Block access but provide instructions to gain access, such as contacting IT or upgrading a device. Use a DLP profile with Access Method: Browser Access to get Netskope Events, Alerts, and DLP Incidents data for private apps. To apply DLP for Browser Access Private Apps, refer to Enforce DLP for NPA Browser Access Private Apps . Protect private apps from malware and malicious activities using Threat Protection policies (applicable only to the Client Access Method). For a specific private app, you may want to have one policy that grants access for a defined set of users, and then use a second policy that blocks and notifies users who don’t have access. To create a Real-time Protection policy for private apps, use the allow or block methods explained below. Allow or Block Access to Private Apps Go to Policies > Real-time Protection . Click New policy and select Private App Access . For Source: Specify the Users, OU, or Groups for which you want to allow/block access to the Private App(s) (otherwise Any user is valid). Specify whether the Access Method is Browser Access or Client (A DLP Profile can only be assigned to Browser Access). For policies with Browser Access Applications, you can also configure Source IP criteria. This enhances security by allowing administrators to restrict (allow or block) access to private applications based on the source (egress) IP of the end-users. Note that Source IP criteria for Browser Access is currently controlled by a feature flag. Please contact your Netskope account team to enable this feature. Note When this feature for Source IP Criteria is enabled for a tenant, the Source IP criteria become available within the policy for Private Apps. While the Source IP criteria will be visible for both Client and Browser Access in the UI, it will currently only apply to Browser Access based applications. Which Operating System the user is allowed/blocked to use (Only valid with access method Client). Which Custom Device Classification profile must be active for the user for the rule to apply (Only valid with the Client Access Method. Browser Access will by default not have any Custom Device Classification and will never hit the Policy as it’s seen as a Unmanaged device). For Destination: Choose either Private App(s) or Private App Tag from the dropdown list. Select the Activities that the destination rule is applied to (Only valid with Browser Access). For Action, select Allow to grant access. To deny access, select Block , select a policy notification template from the dropdown list, or create one. Give the policy a name, and then click Save . Click Apply Changes . Add Threat Protection for Private Apps Netskope One Private Access (NPA) allows organizations to apply Threat Protection to web traffic (ports 80 and 443) for private applications, ensuring files are scanned for malware in real-time. When using Threat Protection with NPA, note that this feature: Requires Client as the Access Method. Scans all web traffic on HTTP (80) and HTTPS (443). Applies real-time scanning to protect private app access from malware and other advanced threats. Netskope One Private Access now also supports Client to Server IPS protections based on HTTP (80) and HTTPS (443). More information can be found here: About IPS Settings . Before You Begin To enable optional advanced protection, complete the following pre-configuration steps: Create a File Hash List Define hash values (MD5/SHA-256) for files to be detected. Use these lists to allowlist (safe) or blocklist (malicious) known file hashes. To configure Threat protection for Real-time Private Access policies: Go to Policies > Real-time Protection . Click New Policy and then Private App Access . On the Real-time Protection policy page, enter the settings for Source (Users, Access Method and other Source Criteria) and Destination (Private App/Private App Tag) first. In the Profile & Action section, select Add Profile and choose Threat Protection Profile . Netskope recommends selecting Default Malware Scan (predefined) , because it automatically scans across all Threat Protection engines your platform is licensed for. Select the Action for each severity level. The recommended action for every severity level is Block . This ensures the best protection for users. To apply a remediation profile for each severity level, select a remediation profile from the dropdown list. Note When the Fallback Action for Advanced File Scanning is set to Alert or Block , some events might not have policy name if there’s a TSS or DLP fail reason. There’s no rule hit because you excluded the Threat Protection rule.You don’t have a catch-all rule at the end of the policy. Optionally, if you selected File Type constraints, and chose a Block action for a severity level, you can see the Block till benign verdict by dynamic threat analysis option. Select to block users from uploading or downloading a file until Netskope dynamic threat analysis provides a benign verdict. The analysis can take up to 10 minutes. For more details, go to Creating a Threat Protection Policy for Patient Zero . Enter a name for the policy and click Save . You are ready to use the malware and malicious sites pages. Related Articles Create a Policy User Notification",
  "content_length": 5953,
  "crawl_timestamp": 1750781090.520341
}