{
  "url": "https://docs.netskope.com/en/configure-netskope-tenants",
  "title": "Netskope Tenants - Netskope Knowledge Portal",
  "content": "To leverage the primary modules to work with Netskope, you need to create a Netskope tenant in Cloud Exchange (CE). Configured Netskope tenants are displayed on the Netskope Tenants page, and Admins can edit and delete configured tenants. Beginning with CE v5.1.0, tenants are added using the Netskope Tenant plugin. For details, go here . You need your Netskope tenant API token(s) to complete this procedure. Obtain your v1 RESTful API token by following the steps in REST API v1 Overview . CE uses v1 tokens for updating file hashes in Threat Exchange. Important A v1 token is required for adding a Netskope tenant in CE, but will not be used if an equivalent v2 endpoint is available. Create a new v2 RESTful API token by following the steps in REST API v2 Overview . For v2 tokens, specific scopes need to be enabled. For more information, see REST API Scopes . When you have your token(s), copy them and then add a tenant to CE. Click play to watch a demo: Add a Netskope Tenant Go to Settings and click Netskope Tenants . A list of configured Netskope tenants are displayed. There are Edit and Delete icons for each tenant in the Action column. Click Add Tenant . Enter a name for this Netskope tenant configuration. Enter your Netskope tenant name. Do not enter the <tenant-URL> , URL. Enter just your tenant name. For example, if it’s mycompany . <tenant-domain> , just enter mycompany . Enter your Netskope tenant API token(s) obtained previously. Select alerts types for filtering alerts from the tenant. The below list represents the minimum requirements per module, but each alert type selected requires the corresponding /api/v2/events/dataexport/alerts/ REST API endpoint to be allowed. Log Shipper: All Ticket Orchestrator: All Threat Exchange: Malsite, Malware User Risk Exchange: Quarantine Application Risk Exchange: None Set the range for ingesting data from Netskope. In this case, set the Initial Range to 7 days to pre-populate Log Shipper. If you use a proxy, enable the proxy toggle. Click Save . Your tenant appears on the page. REST API Scopes For REST API Scopes, go here .",
  "content_length": 2101,
  "crawl_timestamp": 1750780473.4618309
}