{
  "url": "https://docs.netskope.com/en/data-center-pinning-in-netskope-client",
  "title": "Data Center Pinning In Netskope Client - Netskope Knowledge Portal",
  "content": "Netskope’s data center pinning refers to a method that allows administrators to choose a country and a preferred Point of Presence (POP) for Netskope Client connectivity. Use the nsdiag command nsdiag --pin option to manually pin to a POP. The introduction of nsdiag capability provides an interactive mode that helps administrators to pin to a POP. For example, your organization wants to run location-specific campaigns or targeted marketing for your end-users. The administrators can connect to a country POP that is specific to a location. – This feature is available only for GSLB-enabled tenants. – This is currently in Beta. Contact your Netskope Sales Representative to enable this feature in your account. – It works only for Internet Security Services. When the localization zone is enabled for a tenant, the egress IP for outgoing traffic at the POP can be the user’s country IP, rather than the POP’s actual country IP. This can interfere with localized content validation, as the egress IP no longer represents the POP’s geographic location. Supported OS: Windows, MacOS, Linux. Options To Pin Netskope Client To A Preferred POP Use nsdiag ––pin to pin the Netskope Client to a desired POP for connectivity. You can use this option in one of the following ways: Choose the country and then select the preferred POP name. Specifying the country name and POP name directly in the command. Options To Unpin And Revert Netskope Client To The Optimal POP There are two options to unpin the Netskope Client and revert to automatic POP selection whereby the Netskope Cloud selects the most optimal POP for the user: Use nsdiag --unpin to unpin the Netskope Client and revert to automatic POP selection. Reboot machine or process restart. In multi-user deployment setup, pinning is a global operation and not user-specific. When a user pins to a POP, it affects all users on the system. The pin remains effective until you explicitly remove it using the --unpin command or the system clears it automatically on a restart.",
  "content_length": 2026,
  "crawl_timestamp": 1750780661.94861
}