{
  "url": "https://docs.netskope.com/en/enable-snmp-on-a-publisher",
  "title": "Enable SNMP on a Publisher - Netskope Knowledge Portal",
  "content": "This section explains how to enable SNMP v3 on a Publisher and edit the firewall to allow external monitoring. Connect to a Publisher using SSH and log in. On the menu, select 6 and exit to the CLI. Update all packages (recommended). sudo apt-get update Install SNMP. sudo apt-get -y install snmpd libsnmp-dev Configure the agentAddress in the /etc/snmp/snmpd.conf file. Add this line to the file: disk / 10000 Stop the snmpd service so you can add a user. sudo service snmpd stop Add an SNMP v3 user. sudo net-snmp-config --create-snmpv3-user -A <AuthPassword> -X <CryptoPassword> -a <MD5|SHA> -x <AES|DES> <user> Set up the rouser correctly on /etc/snmp/snmpd.conf by adding rouser authPrivUser authpriv -V systemonly . Set up the TCP correctly on /etc/snmp/snmpd.conf by replacing agentaddress 127.0.0.1, [::1] with agentaddress udp:161 . Restart the SNMPD service. sudo service snmpd restart Check that SNMPD is started. sudo service snmpd status Verify the firewall (ufw) is running. sudo ufw status Configure UFW to allow connections to SNMPD. The SNMP daemon will listen for connections on port 161. sudo ufw allow in to any port 161 proto udp Verify the SNMP service has been allowed by the firewall permanently and that UDP traffic on Port 161 is allowed. sudo ufw status Status: active To Action From -- ------ ---- 161/udp ALLOW Anywhere 161/udp (v6) ALLOW Anywhere (v6) To check if snmpd on the Publisher machine works correctly, check the following: sudo service snmpd status snmpd.service - Simple Network Management Protocol (SNMP) Daemon. Loaded: loaded (/lib/systemd/system/snmpd.service; enabled; vendor preset: enabled) Active: active (running) since Fri 2024-05-31 07:26:11 UTC; 59min ago Process: 14823 ExecStartPre=/bin/mkdir -p /var/run/agentx (code=exited, status=0/SUCCESS) Main PID: 14824 (snmpd) Tasks: 1 (limit: 1126) Memory: 5.6M CGroup: /system.slice/snmpd.service └─14824 /usr/sbin/snmpd -LOw -u Debian-snmp -g Debian-snmp -I -smux mteTrigger mteTriggerConf -f -p />",
  "content_length": 1997,
  "crawl_timestamp": 1750781210.66476
}