{
  "url": "https://docs.netskope.com/en/get-started-with-cloud-exchange",
  "title": "Get Started with Cloud Exchange - Netskope Knowledge Portal",
  "content": "These instructions are for the Admin only. This section describes the initial steps for getting started with Netskope Cloud Exchange after installation is complete. Default User Login By default, a single user is created with administrative capabilities with these credentials: Username: admin Password: admin This user will have Administrator level access to the application. This user will have write access, and will be able to create new users as well. On the first login, you will be required to change these credentials. After that, log in using your new credentials. Service Status can be viewed on the i icon mouse hover at the top of the login screen. The default color of that icon should be grey. If any of the services are down, the icon will be highlighted with red color. Enable Modules Upon successful login, enable the modules you want to use. Enabled modules appear in the left panel. Go to the following sections to configure the Cloud Exchange modules you enabled. Configure the Netskope Tenant Settings for Cloud Exchange Before configuring the plugins for the modules you just enable, add a tenant in Cloud Exchange. To do this you must create a RESTful API v1 token in your Netskope tenant at Settings > Tools > REST API . Currently, a Netskope RESTful v1 API token must be installed for Cloud Exchange to communicate with Netskope because it is required for uploading file hashes for use in Threat Protection and DLP policies. You should also create a RESTful API v2 token in your Netskope tenant at Settings > Tools > REST API v2 . Cloud Exchange will use the v2 endpoints whenever possible when communicating with the Netskope tenant. When creating an API token for Cloud Exchange to use to communicate with a Netskope tenant, use least privileged access concepts. API v1 token should be rotated on a regular basis. Create and use in the Netskope Tenant configuration on the Cloud Exchange a properly entitled v2 token with the specified privileges. The Cloud Exchange platform REST API scopes are explained here . Netskope Tenant Plugin v1.4.1 Netskope AWS LogStreaming Tenant v1.0.0 Plugin Netskope Borderless WAN Tenant v1.1.0 Plugin Netskope Tenants Log Shipper v2.2.0 Plugin Ticket Orchestrator v2.2.0 Plugin Log Shipper v1.0.0 Plugin Ticket Orchestrator v.1.0.0 Plugin Threat Exchange v2.1.2 Plugin Risk Exchange v1.1.1 Plugin Threat Exchange v1.0.0 Plugin User Risk Exchange Plugin Application Risk Exchange Plugin Using Beta Plugins Explore the Dashboards Cloud Exchange Setup Videos SSO Configuration Cloud Exchange SSO with Entra ID Cloud Exchange SSO with Okta SSO Access for Netskope Support",
  "content_length": 2628,
  "crawl_timestamp": 1750780340.896279
}