{
  "url": "https://docs.netskope.com/en/install-cloud-exchange",
  "title": "Install Cloud Exchange - Netskope Knowledge Portal",
  "content": "Cloud Exchange runs in a Docker environment in the cloud or on your own hardware with a base OS of Linux. Important Please contact your SE /AM if you have questions regarding CE installation, deployment, configuration, and upgrade/migration. Think of Cloud Exchange as a ready-to-use VM based on Ubuntu 22.04, and already set up with all prerequisites of Cloud Exchange (like Docker, Python, Docker Compose, Zip). As easy to set up and start using Cloud Exchange as before, it is available for major cloud platforms (AWS, Azure, and GCP), as well as for on-premises deployment platforms (VMware ESXi and Hyper-V). Note The maintenance and JWT Secret passwords are used internally within Cloud Exchange for database authentication. These passwords will be needed when restoring a backup. Special characters (including, but not limited to “#”, “$”, “/”, etc.) are not supported when setting the maintenance password for CE. Some of the processes do not work and will cause system failures if you use special characters. Only use alphanumeric values for the maintenance and JWT token passwords. Support Matrix 5.1.1 Platform Cloud Exchange Version Deployment Format VMware ESXi 5.1.1 OVA AWS 5.1.1 AMI Azure 5.1.1 Azure Image Hyper-V 5.1.1 VHDX Image Sizing Matrix Size Epm Cpu/ram (Gb) Disk Space (Gb) Aws Equivalent Azure Equivalent Medium 100k 8/16 80 C62XL F8s_v2 Large 200k 16/32 120 C64XL F16s_v2 Note You will need to change disk size while creating new instances. Note for OS Update Admins SHOULD redeploy CE in the event of functionality/stability issues due to unintentional update of Ubuntu OS for CE as a VM deployment. Select the install instructions that best suit your deployment environment. Install Cloud Exchange on Ubuntu Install Cloud Exchange on a Cloud Platform Install Cloud Exchange on a Virtual Machine Install Netskope Cloud Exchange on a Red Hat Enterprise 8.x Linux Host Troubleshooting Cloud Exchange Installations Upgrade Cloud Exchange Backup Cloud Exchange Backup MongoDB Data Generate and Install SSL Certificates in Cloud Exchange",
  "content_length": 2061,
  "crawl_timestamp": 1750780386.648502
}