{
  "url": "https://docs.netskope.com/en/log-in-to-the-appliance",
  "title": "Log in to the Appliance - Netskope Knowledge Portal",
  "content": "The appliance has two different command prompts: <hostname> : This is the nsshell prompt. <hostname> (config) : This is the configuration prompt (nsshell prompt in configuration mode). You can login to the appliance using one of the two admin user accounts, nsadmin or nstransfer . The nsadmin user account has the privilege to operate and configure the appliance. Whereas the nstransfer user account can be used to upload logs from the appliance using protocols like SFTP, SCP, or FTP. Note Netskope recommends that you set a new password for nsadmin and nstransfer user accounts to secure your appliance. To learn more: Change the Appliance Password . You can also configure SSH keys on the appliance to log in without a password. To learn more: Configure SSH Keys . Change the Appliance Password When setting up a new password for your appliance, follow the best practices, such as: Set a password with a minimum length of 12 characters. Include upper-case and lower-case alphabets, number, and special characters. Change passwords every 90 days. Do not reuse old passwords. To change your appliance password: Connect to the virtual appliance console. Log into the virtual appliance using the credentials: nsadmin/nsappliance . Change your password by using the following command. nsappliance> auth change-password nsadmin New password: <newpassword> Retype new password: <newpassword> passwd: password updated successfully nsappliance> auth change-password nstransfer New password: <newpassword> Retype new password: <newpassword> passwd: password updated successfully At the nsshell prompt, enter configure to go into configuration mode. The command prompt changes to the nsshell configuration prompt ( <hostname> (config) ). Configure SSH Keys To configure the SSH key on the appliance: Connect to the virtual appliance console. Create the SSH key by using the following command: nsappliance(config)# add system ssh-public-keys added index 0 nsappliance(config)# set system 0 ssh-public-keys user nsadmin nsappliance(config)# set system 0 ssh-public-keys key Enter one or more lines of input. When done, press Ctrl-D ssh-ed25519 {SSH key content} nsappliance(config)# save You can now login to the appliance with the SSH key. To create a user that uses the SSH key on the appliance: Connect to the virtual appliance console. Create the new user by using the following command: nsshell> auth nsshell-user add username newuser nsappliance(config)# add system ssh-public-keys added index 2 nsappliance(config)# set system 2 ssh-public-keys user newuser nsappliance(config)# set system 2 ssh-public-keys key Enter one or more lines of input. When done, press Ctrl-D ssh-ed25519 {SSH key content} nsappliance(config)# save You can now log in to the appliance as this user with the SSH key.",
  "content_length": 2790,
  "crawl_timestamp": 1750780840.283551
}