{
  "url": "https://docs.netskope.com/en/migrate-the-virtual-appliance-to-a-103-0-0-338",
  "title": "Migrate the Virtual Appliance to a 103.0.0.338 - Netskope Knowledge Portal",
  "content": "Migrating from previous versions to version 103.0.0.338 of the virtual appliance involves the following steps. Export the configurations from the current VA using the config-transporter script and save the configurations on an external storage. For details about exporting configurations, refer to Exporting Configurations . Install and deploy a new VA. Refer to Install a Virtual Appliance Depending on the availability of IP addresses on the network, choose between the following two options. Setup type 1: Provision new IP addresses for the new VA Setup type 2: Reuse IP addresses from old VA Provision New IP Addresses for a New VA If IP addresses are available on the network, you can setup the new VA with an available IP address. In this case, both, the new and current VAs process logs until you deprovision the current VA. New logs are sent to the new VA for processing while the current VA processes pending logs. To migrate OPLP or Secure Forwarder, follow these steps: Configure the interface on the new VA using the available IP address. Refer to Configure the Interfaces . Import the configurations from the current VA to the new VA using the following command. scp import config from host <hostname or IP> mode without-network path <path to the file or folder> user <username> For details about importing configurations, refer to Importing Configurations . For OPLP: On VA versions older than version 99.0.0, navigate to the lcoplp container. Run the following command. export PATH=$PATH:/opt/ns/bin/docker/tools lcgo lcoplp Stop the OPLP from processing new logs. sudo supervisorctl stop syslogng New logs will now be processed by the new VA. The current VA will continue to process pending logs. To verify the status of unprocessed pending logs, run the following command. /opt/ns/nsenv/bin/python/opt/ns/bin/logcollector/logmanager.py —status Deprovision the current VA using the following command. op deprovision The OPLP stops log processing on the VA and the Secure Forwarder stops forwarding traffic to the VA. Reuse IP Addresses from an Old VA If all the IP addresses in the network are in use, the new VA will reuse the network configurations and IP address of the current VA. In this case, the new logs will be received and processed by the new VA after you configure the IP address. To migrate OPLP or Secure Forwarder, follow these steps. For OPLP: On VA versions older than version 42.14.0, navigate to the lcoplp container. Run the following command. export PATH=$PATH:/opt/ns/bin/docker/tools lcgo lcoplp Stop the OPLP from processing new logs. sudo supervisorctl stop syslogng The current VA will continue to process pending logs. New logs will be processed by the new VA after the current VA is deprovisioned. To verify the status of unprocessed pending logs, run the following command. /opt/ns/nsenv/bin/python /opt/ns/bin/logcollector/logmanager.py —status Deprovision the current VA using the following command. op deprovision The OPLP stops log processing on the VA and the Secure Forwarder stops forwarding traffic to the VA. Import the configurations from the current VA to the new VA using the following command. scp import config from host <hostname or IP> mode all path <path to the file or folder> user <username> For details about importing configurations, refer to Importing Configurations .",
  "content_length": 3335,
  "crawl_timestamp": 1750780893.456448
}