{
  "url": "https://docs.netskope.com/en/netskope-help/netskope-client/netskope-client-deployment-options/vmware-workspace-one/deploy-client-on-windows-using-vmware-workspace-one/",
  "title": "Deploy Client on Windows Using VMware Workspace ONE - Netskope Knowledge Portal",
  "content": "This document lists the steps to deploy Netskope Client on Windows devices. Create Enrollment User Login to Workspace One admin console. Click Add > User from the header menu options. In the Add / Edit User pop-up windows, enter all required user details. Upload Client Installer File Goto Resources > Apps > Native . In the Internal tab, click Add and select Application File . Click Choose file and locate the Netskope Client installation file ( with the msi extension ). You can download the latest installation files from Netskope Support . After selecting the file, click SAVE to continue. In the Add Application pop-up, select NO for Is this a dependency app? option. Click the Continue button. This will display the details of uploaded installer file. In the Details tab, leave the form data with default values. In the Deployment Options tab, scroll down to the Install Command field and enter the following command: msiexec /I NSClient.msi installmode=idP tenant=corp domain=eu.example.com /qn For additional MSIExec configuration options, refer Netskope Client for Windows . Note Ensure that you end the command with the /qn parameter for silent and uninterrupted installation. Leave all other options with default values. If Secure Enrollment feature is enabled, each deployment mode consists of two additional parameters (Authentication and Encryption token): ​​enrollauthtoken: ​​ Specifies the authentication token. ​​ enrollencryptiontoken:​​ Specifies the encryption token. Click Save and Assign . From the Assignment page, enter the following details: Name: Specify a name for this delivery or deployment. Description: Optional parameter to add more information about the deployment. Assignment Groups: Select the groups in your organization to deploy the Client. Deployment Begins: Time to start the deployment. Leave the default options as is. App Delivery Method: Select Auto or On-Demand. Auto option will auto deploy client at the configured time. On-Demand can be used to deploy only when required for specific devices or groups. Click Create . From the Assignment details page, click Save . From Preview of the Assigned Device s, click Publish . Once the deployment is complete, go to Resources > Native and click the uploaded client. This will display a pop-up window with the status deployment.",
  "content_length": 2320,
  "crawl_timestamp": 1750780970.912384
}