{
  "url": "https://docs.netskope.com/en/netskope-product-eol-announcements",
  "title": "Netskope Product EOL/EOS Announcements - Netskope Knowledge Portal",
  "content": "EOL for In-Tenant EDR Partner Integrations Netskope will no longer support in-tenant Endpoint Detection and Response (EDR) integrations with partners after December 1, 2025. In-tenant Standard Threat Protection EDR integrations and related threat remediation profiles will be turned off. Netskope recommends customers using in-tenant partner EDR integrations (e.g., CrowdStrike or Carbon Black) migrate to Netskope Threat Exchange for EDR integrations. Threat Exchange is a near real-time threat ingestion, curation, and sharing tool that enables Netskope customers and technology partners to bi-directionally exchange IOCs in their Netskope tenant. In addition to CrowdStrike EDR and Carbon Black, Threat Exchange integrates with dozens of different EDR, IR, SIEM, SOAR, or custom API-based tools and is extensible to additional partners. Threat Exchange is freely available to customers as a community tool. Milestone Definition Date End-of-Life Announcement Date The date the end-of-life of a product is announced to the general public. May 22, 2025 End-of-Support Date After this date, the service will not be available. December 1, 2025 End-of-Support Of Linux Versions Netskope Client will no longer support the following Linux versions after May 31, 2025. Milestone Os Versions Eos Date End-of-support Linux Ubuntu 20.04 Linux mint versions 19 and 20 May 31, 2025 End-Of-Support of Old MacOS Versions Netskope Client will no longer support the following macOS versions after Dec 31, 2024: Milestone Operating System Versions Definitions Eos Date End-of-support macOS 11 (Big Sur), 12 (Monterey), After this date, Netskope Client no longer supports macOS versions 11 and 12. Dec 31, 2024 End-of-support Android 11 (Red Velvet Cake) After this date, Netskope Client no longer supports Android version 11. Dec 31, 2024 Netskope recommends using macOS version 13 or above to receive Netskope support for any Netskope Client related issues in the future. EOL for a SSPM V2 Endpoint Publication Date: 7/18/2024 Netskope announces the end-of-life and end-of-support for API v2 endpoints described in this section. SSPM supports rule categorisations based on Compliance Standard, Mitre Attack, Domain and Netskope Best Practice. Accordingly, APIs for listing and reading compliance standards are replaced by more generic APIs. Refer to the following table for more information: Deprecated Api Alternative Api Use /api/v2/spm/rules/cs/{cs_id} /api/v2/spm/rules/categories/cs/subcategories/{id} To see information about specific compliance standard EOL for DNS Connector & DNS Mode on DPoP Publication Date: 6/28/2024 Netskope announces the end-of-life and end-of-support dates for the DNS Connector function of the directory tools as well as Dataplane On-Premises (DPoP) with DNS mode deployment. Refer to the following table for the milestones, definitions, and dates for the affected products: Milestone Definition Date End-of-Life Announcement Date The date the end-of-life of a product is announced to the general public. July 1, 2024 End-of-Support Date The last date to receive applicable service and support for the feature, as entitled by active service contracts or by warranty terms and conditions. After this date, all supported services for the product are unavailable and the product becomes obsolete. September 30, 2024 DPoP supported two modes of deployment: DNS mode and explicit proxy mode. With DNS mode, DPoP transparently proxied SaaS applications by integrating with customer DNS servers using the DNS Connector. On September 30, 2024, DPoP DNS mode steering and the DNS Connector functionalities for the Netskope directory tools will no long be supported. Customers using DPoP in DNS mode steering must switch to explicit proxy mode. For more information on configuring DPoP in explicit proxy mode, go to: Configure the Appliance in Explicit Proxy Mode . Contact your Customer Success Manager or Netskope representative if you have any questions. EOL for Messenger Service for Appliance Publication Date: 6/3/2024 Netskope plans to decommission the messenger service ( messenger-<tenant-url> ) and consolidate the reporting and status updates via the callhome service ( callhome-<tenant-url> ) when the appliance connects to the Netskope management console. The decommissioning will impact only when the SNMP feature is enabled on Netskope appliances including OPLP, DPoP, CDPP, or DLP EDM/Fingerprint hashing VA deployment. Once decommissioned, the SNMP OID and SNMP trap for management plane status monitoring will no longer function, and will receive the “MP connection down” SNMP notification. Other SNMP configurations will continue to function. Appliance release version 113 and newer will not have this specific SNMP OID or SNMP trap. Customers must upgrade appliances to version 113 to avoid receiving these SNMP status messages. This is an advance notification to enable customers to plan software upgrades as required. Milestone Definition Date End-of-Life Announcement Date The date the end-of-life of a product is announced to the general public. June 3, 2024 End-of-Support Date After this date, the messenger service will not be available. December 30, 2024 Customer Impact : Any appliance version older than the Appliance R113 release with SNMP configured will receive a “MP connection down” SNMP notification after December 30, 2024. The impacted SNMP Netskope OID is managementplaneStatus . The impacted SNMP trap is mpConnectionNotif . Action Required : Customers who deploy an appliance with SNMP configured must upgrade the appliance to Appliance version R113 or newer. Remove the firewall rule for messenger-<tenant-URL> if it was added, as it will not be used going forward. For more information on SNMP MIBs, go to: Configure SNMP . For more information on upgrading the virtual appliance, go to: Upgrade the Virtual Appliance . Contact your Customer Success Manager or Netskope representative if you have any questions. EOL for Netskope Adapters/Directory Tools Publication Date: 4/26/2024 At Netskope, we ensure that our customers are protected with the latest and greatest version of the products that we offer. We will enhance the cipher strength on the Netskope platform, which is incompatible with older Windows operating systems. On December 1, 2024, The following OS’s will no longer be supported with Netskope Directory Tools, which include AD Importer, DNS Connector, and AD Connector. Windows 7 64-bit Windows 2008 R2 64-bit Windows 2012 64-bit Windows 2012 R2 Customer Impact : On December 1, 2024, The OS’s listed above will no longer be able to connect to Netskope platform with the Directory Tool applications. Action Required : Customers using the Directory Tools must upgrade to one of these supported OS versions: Windows 10 64-bit Windows 11 Windows 2016 Windows Server 2019 Windows Server 2022 For more information on the Directory tool, go to: Netskope Adapters . Contact your Customer Success Manager or Netskope representative if you have any questions. EOL for Specific REST API v1 Endpoints Publication Date: 3/21/2024 Note Update as of: May 6, 2025 In the last several months, Netskope has made a considerable effort to extend the timeline announced above to accommodate a number of customer requests. The final EOS date has now been set for May 31, 2025. This is the advanced notification for the planned End of Life (EOL) for specific REST API v1 endpoints described in this article. Netskope currently offers a wide variety of REST API endpoints for automating operational workflows. The first generation of these APIs are referred to as REST API v1, and the second generation of these APIs are referred to as REST API v2. REST API v2 represents the modern, current version that utilizes the latest capabilities for authentication and authorization, which will continue to evolve in the future. In order to continue to provide the best in class capabilities, as well as robust technical support for REST API, it is imperative that we periodically assess and deprecate REST API endpoints that are no longer preferred. With this notice we are announcing the EOL of specific REST API endpoints (refer to the APIs listed below). Milestone Definition Date EOL Announcement Date The date the EOL notice is shared with the general public. April 1, 2024 EOS Date After this date, the REST API v1 endpoints will not be available for integration (R123). All documentation of REST API v1 endpoints will be archived. January 31, 2025 NOTE There will be no impact for the existing User/Group info as they change the Base URL. When migrating to the new SCIM Base URL or Reverting the change back due to unforeseen issues. Full sync is not required as part of this migration. For more information about REST API v2, refer to the product documentation , or contact Netskope Support. Important If your Netskope tenant is hardened using IP Allowlist ( Settings > Administration > IP Allowlist ), then ensure that you add the respective source IP addresses of your integrated REST API V2 services to the Custom IP list. Here’s the list of the EOL’ed REST API Endpoints, and the recommended replacement APIs to use instead. Api Replacement Apis V1 Article /api/v1/alerts /api/v2/events/dataexport/alerts/uba /api/v2/events/dataexport/alerts/securityassessment /api/v2/events/dataexport/alerts/quarantine /api/v2/events/dataexport/alerts/remediation /api/v2/events/dataexport/alerts/policy /api/v2/events/dataexport/alerts/malware /api/v2/events/dataexport/alerts/malsite /api/v2/events/dataexport/alerts/compromisedcredential /api/v2/events/dataexport/alerts/ctep /api/v2/events/dataexport/alerts/dlp /api/v2/events/dataexport/alerts/watchlist Get Alerts Data – Netskope Knowledge Portal /api/v1/events /api/v2/events/dataexport/events/application /api/v2/events/dataexport/events/audit /api/v2/events/dataexport/events/connection /api/v2/events/dataexport/events/incident /api/v2/events/dataexport/events/infrastructure /api/v2/events/dataexport/events/network /api/v2/events/dataexport/events/page Get Events Data – Netskope Knowledge Portal /api/v1/role /api/v2/platform/roles Manage User Roles – Netskope Knowledge Portal /api/v1/updateUrlList /api/v2/policy/urllist Update a URL List – Netskope Knowledge Portal /addon-*.goskope.com/SCIM/v2 /api/v2/scim/Users /api/v2/scim/Groups SCIM Settings for User Provisioning",
  "content_length": 10372,
  "crawl_timestamp": 1750779889.637324
}