{
  "url": "https://docs.netskope.com/en/netskope-client-network-configuration/",
  "title": "Netskope Client Network Configuration - Netskope Knowledge Portal",
  "content": "This topic describes the various network configuration requirements for Netskope Client with respect to Global Server Load Balancing (GSLB) and how it works. Client Outbound Connectivity Requirements For normal functioning, the Netskope Client must be allowed to connect outbound directly to the subnets, domains, ports, and protocols as given in the following tables: Important – Firewalls and Proxies: Allow these connections without decryption. – Full Tunnel VPNs: Add these connections as exceptions or exclusions. – Split Tunnel VPNs: Do not include these connections. – The following document includes references to Internet Security which includes NG-SWG, Cloud Inline, Inline CASB, Cloud Firewall, and DNS Security. – The following document includes references to Private Access which is also known as Netskope Private Access, NPA, and ZTNA Next L7. – HTTP/2: We negotiate HTTP/2 for all domains if the origin server supports it, otherwise, we fallback to HTTP 1.1. All other traffic will continue to leverage HTTP 1.1.The protocol change is completely transparent to users, no configuration is required by admins. Contact Support to enable this feature in your account. – In addition, the Netskope Client and GRE / IPSEC and iOS access methods are fully supported. Client Version: 109.0.0 or later The following section applies to tenants with Client version 109.00 or later where the GSLB feature is enabled for Internet Security and Private Access. All Clients connecting to the tenant should be running version 109.0.0 or later before enabling GSLB. Netskope Products Destination Subnets And Domains Protocols/ports Purpose Internet Security Private Access All Netskope NewEdge Data Center Subnets TCP/443 TLS connectivity to Netskope NewEdge data plane for Internet Security and Private Access. UDP/443 DTLS connectivity to Netskope NewEdge data plane for Internet Security. ICMP Type 8 and 11 UDP/33434 GSLB Automated Route Control. PDEM latency metrics collection. Internet Security Private Access Endpoint SD-WAN DNS Servers UDP/53 DNS lookups for connectivity to Netskope services. This can be a private or public DNS server, but must resolve public domains. Private Access *.npa.goskope.com Contact Netskope Support, or Sales Representatives if tenant-specific domains or IP subnets are required. TCP/443 Client enrollment and re-enrollment for Private Access. Endpoint DLP epdlp.gslb.goskope.com *.epdlp.goskope.com epdlp-prod.netskope.io TCP/443 Endpoint DLP connectivity and policy updates. Internet Security Private Access enrollment.goskope.com enrollment.*.goskope.com enrollment.*.govskope.ca enrollment.*.govskope.us Contact Netskope Support or your Sales Representative if tenant-specific domains are required. TCP/443 Secure Enrollment connectivity. Internet Security Private Access gateway.gslb.goskope.com TCP/443 GSLB latency-based Gateway Selection for Internet Security and Private Access (API call to request the list of nearby data centers). GSLB Netskope NewEdge IP space ICMP type 8 and 11 UDP 33434-33498 Network path telemetry to Netskope data centers. Endpoint SD-WAN Admin managed Borderless SD-WAN Gateway Hub UDP/443 L3 Tunnel from Endpoint to Gateway Hub. *.googleapis.com TCP/443 Application Detection using First Packet Detection. Client Version: 103.0.0 to 108.x.x This section applies to tenants with Client version 103.0.0 or later where the GSLB feature is enabled for Internet Security and disabled for Private Access. All Clients connecting to the tenant should be running version 103.0.0 or later before enabling GSLB. Netskope Products Destination Subnets And Domains Protocols/ports Purpose Internet Security Private Access Netskope Subnets Documentation TCP/443 GSLB latency-based Gateway Selection for Internet Security. TLS connectivity to Netskope NewEdge data plane Internet Security and Private Access. UDP/443 DTLS connectivity to Netskope NewEdge data plane for Internet Security. Internet Security Private Access DNS Servers UDP/53 DNS lookups for connectivity to Netskope services. This can be a private or public DNS server, but must resolve public domains. Private Access dns.google 8.8.8.8 8.8.4.4 TCP/443 EDNS geolocation-based Gateway Selection for Private Access. If this is blocked or fails, LDNS geolocation-based Gateway Selection will be used which can result in higher latency connectivity. Private Access *.npa.goskope.com Contact Netskope Support, or Sales Representatives if tenant-specific domains or IP subnets are required. TCP/443 Client enrollment and reenrollment for Private Access. All Client Versions This section applies to all tenants with any Client version where the GSLB feature is disabled for Internet Security and Private Access. Netskope Products Destination Subnets And Domains Protocols/ports Purpose Internet Security Private Access dns.google 8.8.8.8 8.8.4.4 TCP/443 EDNS geolocation-based Gateway Selection for Internet Security and Private Access. If this is blocked or fails, LDNS geolocation-based Gateway Selection will be used which can result in higher latency connectivity. Internet Security Private Access DNS Servers UDP/53 DNS lookups for connectivity to Netskope services. This can be a private or public DNS server, but must resolve public domains. Internet Security Private Access addon-<tenant>[.region].goskope.com TCP/443 Downloading configuration files and dynamically detecting proxies. Internet Security Private Access download-<tenant>[.region].goskope.com TCP/443 Downloading client package updates. Internet Security Private Access nsauth-<tenant>[.region].goskope.com TCP/443 IdP-based Client Enrollment and Periodic Re-authentication for Private Apps. Internet Security gateway- [.region].goskope.com gateway-backup- [.region].goskope.com TCP/443 Primary and Backup TLS connectivity to Netskope NewEdge data plane for Internet Security. UDP/443 Primary and Backup DTLS connectivity to Netskope NewEdge data plane for Internet Security. Internet Security achecker-<tenant>[.region].goskope.com TCP/443 Client enforcement. This is required to enforce the end-user to install the Client on their device. If the Client is not installed in the users’ device, access to an app or domain specified in the steering configuration is restricted and the user is redirected to a browser page with instructions to install the Client. Private Access gateway.npa.goskope.com TCP/443 TLS connectivity to Netskope NewEdge data plane for Private Access. Private Access *.npa.goskope.com Contact Netskope Support, or Sales Representatives if tenant-specific domains or IP subnets are required. TCP/443 Client enrollment and re-enrollment for Private Access. Publisher Outbound Connectivity Requirements This section applies to all Private Access Publisher versions starting with 109.0.0 where the GSLB feature is enabled for Private Access publishers. Netskope Products Destination Subnets And Domains Protocols/ports Purpose Private Access Publisher Netskope Subnets Documentation TCP/443 TLS connectivity to Netskope NewEdge data plane. Private Access Publisher gateway.gslb.goskope.com TCP/443 GSLB latency-based Stitcher Selection for Private Access Publishers (API call to request the list of nearby data centers). Private Access Publisher DNS Servers UDP/53 DNS lookups for connectivity to Netskope services. This can be a local or public DNS server, but must resolve public domains. Private Access Publisher *.docker.com *.docker.io *.ubuntu.com TCP/443 Publisher updates Private Access Publisher *.ubuntu.com TCP/80 Publisher updates Private Access Publisher *.npa.goskope.com Contact Netskope Support, or Sales Representatives if IP subnets are needed instead of FQDNs. TCP/443 Publisher registration NewEdge Traffic Management Gateway Selection NewEdge Traffic Management 2.0 (GSLB) is a latency-based gateway selection method that uses a proprietary Netskope-hosted API service instead of relying on third-party services such as Google DNS. Global Server Load Balancing (GSLB) provides a better user experience by allowing Netskope to quickly identify and address network issues, improve performance, improve stability, and improve resilience. The Netskope Client now considers many nearby NewEdge data centers and calculates latency (RTT) to each, then selects the data center with the lowest latency. If GSLB cannot be reached then the Netskope Client falls back to the previous extended DNS(EDNS) and local DNS(LDNS) geolocation-based gateway selection behavior. GSLB services are available for Internet Security and Private Access. NG-SWG: This feature is enabled by default for tenants created after the release of platform version 109. To enable this feature for tenants created earlier, contact your Sales Representative or Netskope Support. Private Access: GSLB services are available for all tenants. To enable this feature contact your Sales Representative or Netskope Support. In the event of GSLB call failure, Publisher and Netskope Client fallback to EDNS or LDNS. By default GSLB will return 10 nearby data centers to test for latency. Contact Support to modify this value. For Private Access: The minimum version for Client and Publisher must be 109.0.0. Older versions continue to work with EDNS/LDNS. Restart of Netskope Client and Publisher may be required upon enabling the feature: If GSLB functionality is enabled for Netskope Client versions 108.0.0 or lower, updating to 109.0.0 activates GSLB automatically without requiring a restart. If the GSLB functionality is enabled for Netskope Publisher versions 108.0.0 or lower, updating to 110.0.0 activates GSLB automatically without requiring a restart. You can now configure New Edge Traffic Management Zones per tenant. Contact Support to configure this feature. Do not support Periodic RTT checks during the session. Fallback to EDNS/LDNS can be disabled. Contact Support to configure this feature. Supported Operating Systems New behavior is supported on all operating systems. For more details, view Netskope Client Supported OS and Platform . Prerequisites Refer to the tables in the previous sections of this page for Client version and network connectivity requirements. Refer to the Support portal to understand the allowed IP ranges for outbound access on your firewall. FedRAMP High IPs are different and the current list can be found here: https://support.netskope.com/s/article/NewEdge-Consolidated-List-of-IP-Range-for-Allowlisting (Requires a Support account). To collect Client logs through the Netskope tenant, view Unable to collect client debug logs remotely (Requires a Support account). Also, ensure that your VPN is not configured to tunnel those IP ranges through a VPN tunnel. To learn more about VPN compatibility, view VPN Applications . GSLB Gateway Selection Process The Netskope Client connects to Netskope’s API (gateway.gslb.goskope.com) using HTTPS (tcp/443) to request a list of nearby Netskope data centers. Netskope’s API uses the public IP of the API request to look up the geolocation of the endpoint. Netskope’s API then responds with a list of geographically nearby Netskope data centers. The Netskope Client tests latency to each of the nearby Netskope data centers. The Netskope Client utilizes these latency measurements to pick the best data center (DC). This is generally the one with the lowest latency (RTT); however, in some cases a nearby DC with similar latency characteristics may be selected. If the HTTPS connection to Netskope’s API is steered through a VPN, this will change the public IP of the request and incorrectly geo locate the user, which can result in the Netskope Client connecting to a Netskope data center far from the endpoint. If the endpoint’s public IP is incorrectly registered with geolocation databases, this can result in the Netskope Client connecting to a Netskope data center far from the endpoint. If the HTTPS connection to Netskope’s API is blocked, the Netskope Client will attempt to use EDNS and LDNS for gateway selection. Netskope Private Access tenants may now take advantage of NewEdge Traffic Management intent-based Zones. Some organizations have inline (or “data in motion”) compliance requirements that restrict inline traffic processing to specific geographical regions.Now, the Private Access tenants can restrict traffic to supported Zones. To learn more: Configure NewEdge Traffic Management Zones per NPA Tenant . Gateway Selection Behavior Using EDNS and LDNS NewEdge Traffic Management 1.0 is a geolocation-based gateway selection method that uses DNS. Initially, the Netskope Client used EDNS to resolve one of the following gateway fully qualified domain names(FQDN): gateway-<tenant>[.region].goskope.com gateway-backup-<tenant>[.region].goskope.com If EDNS resolution fails then the Netskope Client uses LDNS to resolve the gateway FQDNs. EDNS Gateway Selection Process Refer to the following instructions to understand the EDNS gateway selection process: The Netskope Client connects to Google DNS (dns.google) using DNS over HTTPS (tcp/443) to request an IP for gateway-<tenant>[.region].goskope.com. Google DNS uses the public IP of the DNS over HTTPS request to look up the geolocation of the endpoint. Google DNS then resolves gateway-<tenant>[.region].goskope.com to the Netskope data center geographically closest to the endpoint’s public IP. The Netskope Client connects to the Netskope data center using the provided IP. If the DNS over HTTPS connection is steered through a VPN, this changes the public IP of the request and incorrectly geo-locates the user, which can result in the Netskope Client connecting to a Netskope data center far from the endpoint. If the endpoint’s public IP is incorrectly registered with geolocation databases, this can result in the Netskope Client connecting to a Netskope data center far from the endpoint. If the DNS over HTTPS connection is blocked, the Netskope Client attempts to use LDNS to resolve gateway-<tenant>[.region].goskope.com. LDNS Gateway Selection Process Refer to the following instructions to understand the LDNS gateway selection process: The Netskope client uses the endpoint’s configured DNS server using standard DNS (udp/53) to resolve gateway-<tenant>[.region].goskope.com. The Netskope Client connects to the Netskope data center using the provided IP. If the DNS server’s public IP is registered geographically far from the endpoint, this can result in the Netskope Client connecting to a Netskope data center far from the endpoint. For example, if the endpoint is in San Jose, CA, but it is configured to use a corporate DNS server located in Ashburn, VA, the endpoint will connect to a Netskope data center near Ashburn, VA. This would result in significant additional latency for all Internet and Private Access connectivity through Netskope. GSLB Fallback in China With the release of version 121.0.7, for tenants using Netskope’s POPs in China, devices running Netskope Client outside China can now fallback to EDNS and then to LDNS when GSLB is not reachable. At the same time, devices with Netskope Client in China continue to use GSLB exclusively to ensure that those users only connect to Netskope POPs within China. This is the default behavior for all tenants using Netskope’s POPs in China. Validate EDNS/LDNS You can check for the country code in your logs while debugging: If the location is in China: 2024/09/25 17:33:58.421 stAgentSvc p1d14 t1ed8 info GatewaySelection.cpp:139 gslb [NSClient] Pops fetched begin rtt_protocol:tcp country:CN If the location is outside China: 2024/09/25 09:09:52.105766 stAgentNE p14257 t15367 info GatewaySelection.cpp:139 gslb [NSClient] Pops fetched begin rtt_protocol:http country:US Netskope Client in a Non-Proxy Environment Here are the packet flow details of how the cloud app traffic is intercepted and sent through the tunnel when the client is installed in a non-proxy environment: The Client establishes the SSL tunnel between the Client and the Netskope gateway. Browser/App sends a DNS request for a managed cloud service ( For example: Box.com ). Browser/App receives a DNS response ( For example: 74.112.184.73 ). The Client driver captures DNS response and creates a map of domain and IP ( For example: Box.com = 74.112.184.73 for cloud app domains ). Browser/App sends packets to Box.com ( For example: DST IP 74.112.184.73 ). Client tunnels Box traffic ( For example: DST IP 74.112.184.73 ) through the SSL tunnel. Netskope Client in an Explicit Proxy Environment Here are the packet flow details of how the Cloud app traffic is intercepted and sent through the tunnel when the client is installed in an explicit proxy environment: The Client establishes the SSL tunnel between the Client and the Netskope gateway. The Client first tries to connect directly through default gateway to establish the SSL tunnel. If this is blocked, then it looks for system proxy settings, such as PAC (proxy auto-config) files, WPAD (Web Proxy Auto-Discovery Protocol), and manual configuration. The client uses the proxy settings and connects to the Netskope gateway via HTTP Connect. The Netskope gateway should be SSL allowlisted if the proxy is configured for SSL decryption. If your environment uses firewall or proxy, ensure that you process the backup gateway URL in the same manner as the primary gateway URL. The backup gateway URL is suffixed with gateway-backup to your primary URL. The browser or native app reads the proxy settings (PAC file, explicit proxy setting) and opens a connection to an explicit proxy server, for example: ep.customer.com . The client parses the initial header of the connection. If the initial header indicates the connection is: Cloud mode (SaaS app): The initial header indicates the hostname of the SaaS application. If the hostname is not a part of the managed SaaS application exception configuration, the Client bypasses the traffic to a local proxy server. Web and All Traffic mode: The initial header indicates the hostname of the web application. If the hostname is a part of the exception, the Client bypasses the traffic to a local proxy server. Otherwise, the traffic is tunneled to the Netskope gateway. If the initial header does not indicate SaaS app HTTPS access, the Netskope Client bypass the traffic and forwards the entire payload to the explicit proxy server. For example: ep.customer.com. Netskope Client Log Messages with On-prem Proxy Steering traffic flow and Log message : With on-prem proxy, the Netskope Client monitors for HTTP CONNECT requests. It checks for the domain name in these requests against the managed domain list. If the name matches then it will reconstruct the TCP SYN packet and send it through the Netskope Tunnel and at the same time it will send TCP RST to on-prem proxy, and it will take control of that connection. After the TCP 3-way handshake with Netskope proxy, it sends the HTTP CONNECT request and the flow continues with Netskope proxy. Since TCP flow will be with destination IP of on-prem proxy when Netskope Client logs the message, it will show destination IP as on-prem Proxy and the domain name will be the managed domain. Assuming on-prem Proxy IP is 10.10.10.11 and Proxy port is 8080 and the managed domain is www.box.com then you will see the log line as below: 2021/07/18 17:16:11.282 stAgentSvc pfbc t296c 4 tunnel.cpp:618 nsTunnel TLS [sessId 1] Tunneling flow from addr: 192.168.13.40:49614, process: chrome.exe to host: www.box.com,addr: 10.10.10.11:8080",
  "content_length": 19478,
  "crawl_timestamp": 1750780630.493761
}