{
  "url": "https://docs.netskope.com/en/netskope-help/netskope-client/netskope-client-deployment-options/netskope-client-for-windows/",
  "title": "Netskope Client For Windows - Netskope Knowledge Portal",
  "content": "The MSIEXEC command is used to mass deploy Netskope Client (MSI packages) on Windows devices. Supported Operating Systems Refer to Netskope Client Supported OS and Platform to understand the supported versions for Windows. Download Client Packages You can download Netskope client installers from Download Netskope Client and Scripts . Netskope Client MSIEXEC Parameters Refer to the following table to understand the parameters added in the MSIEXEC command: Parameter Description /I Not required for some MDM configurations. Required for normal MSIEXEC installation from the CLI. For more information, view Microsoft MSIEXEC . tenant= Required when enrolling users using IDP. Do not use it when enrolling a user using UPN. For example, If your tenant hostname is corp.goskope.com use tenant=corp If your tenant hostname is corp.eu.goskope.com use tenant=corp domain=[region.] Required when enrolling users using IDP. Do not use it when enrolling a user using UPN. For example, If your tenant hostname is corp.goskope.com use domain=goskope.com If your tenant hostname is corp.eu.goskope.com use domain=eu.goskope.com installmode=idp Required when enrolling users using IDP. Do not use it when enrolling a user using UPN. host=addon- .[region.] Required when enrolling users using UPN. Do not use it when enrolling users using IDP. This is the addon hostname of your tenant. For example, If your tenant hostname is corp.goskope.com use host=addon-corp.goskope.com If your tenant hostname is corp.eu.goskope.com use host=addon-corp.eu.goskope.com token= Required when enrolling users using UPN. Do not use it when enrolling users using IdP. To find your organization ID: Login to your Netskope Admin Console with admin credentials. Go to Settings > Security Cloud Platform > MDM Distribution. Locate your Organization ID under the Create VPN Configuration section. The organization ID is case-sensitive. enrollauthtoken= Required when enrolling users using UPN with Secure Enrollment Authentication Token that is enabled and enforced. Required when using Private Access Prelogon (UPN and IdP enrollment) with Secure Enrollment Authentication Token that is enabled and enforced. enrollencryptiontoken= Required when enrolling users using UPN or IdP with Secure Enrollment Encryption token enabled and enforced. mode=peruserconfig (Optional Parameter) Use when installing on a multi-user system. With this parameter set, each user needs to enroll Netskope Client independently. Without this parameter set, the Netskope Client can enroll one time and use a single configuration system wide. npavdimode=on (Optional Parameter) Use when installing on a multi-user Windows desktop with concurrent users logged on at the same time, such as some Citrix VDI or Azure Virtual Desktop Environments. userconfiglocation= (Optional Parameter) Overrides the default path for storing the user configuration. It is recommended to leave this parameter out (allow the default path) unless users' home directories are hosted on external file servers or network shares. And this parameter is recommended to be used only for multi-user systems (when mode=peruserconfig is included in the parameters). The default path: %AppData%\\Netskope\\STAgent Note: The custom path could be an absolute path, a network share, or a path having environment variables. Environment variables need to be properly escaped depending on how the MSIEXEC command is run: If running from a command prompt, append ^ before each % Example: >msiexec /I NSClient.msi mode=peruserconfig userconfiglocation=C:\\Users\\^%USERNAME^%\\Netskope If running from a batch script, append % before each % Example: >msiexec /I NSClient.msi mode=peruserconfig userconfiglocation=C:\\Users\\%%USERNAME%%\\Netskope If running from SCCM (or other mass deployment tool), append ^ before each % and prefix with cmd /c Example: >>cmd /c msiexec /I NSClient.msi mode=peruserconfig userconfiglocation=C:\\Users\\^%USERNAME^%\\Netskope fail-close=disable|no-npa (Optional Parameter) This overrides the Fail Close settings in the Client Configuration. disable: Explicitly disable fail-close on this device. no-npa: Allow Private Access (NPA) traffic even if the Internet Security tunnel cannot be established and Fail Close is blocking Internet traffic. prelogonuser= @prelogon.netskope.com (Optional Parameter) Use when deploying Private Access Prelogon. For more information, view Prelogon. autoupdate=on|off (optional Parameter) on: Default value which allows auto updating of Netskope Client based on the Client Configuration. If Client Configuration has auto update disabled then Netskope Client will not auto update on this system. off: Disable auto updating of Netskope Client. This overrides the Client Configuration and will prevent any Netskope Client auto updates on this system. /l*v (optional Parameter) Sets the MSIEXEC installation log file path. For Example: /l*v %PUBLIC%nscinstall.log /qn (optional Parameter) Use this option for silent installation. Netskope Client Deployment Commands – Examples The parameters used depend on the deployment mode, features required, and environment. Use the table in the previous section and the following examples for more information. – Always enter the command and parameters in a single line without any line-breaks. – Some MDM deployments (for example Microsoft Intune) only require the parameters and do not require the leading msiexec /I NSClient.msi part in the following examples. – The /j option is not supported while using the MSIEXEC command for Netskope Client installation. IDP UPN MDM Prelogon Connectivity for Netskope Private Access To learn more, view Deploy Netskope Client via IdP . Deployment Option Command All MSIEXEC IDP Options msiexec /I NSClient.msi tenant= domain=[region.] installmode=idp [enrollauthtoken= ] [enrollencryptiontoken= ] [mode=peruserconfig [npavdimode=on] [userconfiglocation= ]] [fail-close=no-npa|disable] [prelogonuser= @prelogon.netskope.com] [autoupdate=on|off] [/l*v %PUBLIC%nscinstall.log] [/qn] Single-User Mode Installation for IdP-based Enrollment System-level enrollment based on the first user to enroll Netskope Client using IdP msiexec /I NSClient.msi tenant= domain=[region.] enrollencryptiontoken= /qn Example 1: msiexec /I NSClient.msi tenant=corp domain=goskope.com installmode=IDP enrollencryptiontoken=XXX /qn Example 2: msiexec /I NSClient.msi tenant=corp domain=eu.goskope.com installmode=IDP enrollencryptiontoken=XXX /qn Multi-User Mode Installation for IdP-based Enrollment Per-user enrollment; each user must enroll Netskope Client using IdP msiexec /I NSClient.msi tenant= domain=[region.] enrollencryptiontoken= mode=peruserconfig /qn Example 1: msiexec /I NSClient.msi tenant=corp domain=goskope.com installmode=IDP mode=peruserconfig enrollencryptiontoken=XXX /qn Example 2: msiexec /I NSClient.msi tenant=corp domain=eu.goskope.com installmode=IDP mode=peruserconfig enrollencryptiontoken=XXX /qn Deployment Option Command All MSIEXEC UPN Options msiexec /I NSClient.msi host=addon- .[region.] token= [enrollauthtoken= ] [enrollencryptiontoken= ] [mode=peruserconfig [npavdimode=on] [userconfiglocation= Single-User Mode Installation for Domain-joined Endpoints System-level enrollment; auto-enrolled one time based on the UPN of the first domain user to log in msiexec /I NSClient.msi host=addon- .[region.] token= enrollauthtoken= enrollencryptiontoken= /qn Example 1: msiexec /I NSClient.msi host=addon-corp.goskope.com token=XXX enrollauthtoken=XXX enrollencryptiontoken=XXX /qn Example 2: msiexec /I NSClient.msi host=addon-corp.eu.goskope.com token=XXX enrollauthtoken=XXX enrollencryptiontoken=XXX /qn Multi-User Mode Installation for Domain-joined Endpoints Per-user enrollment; each user auto-enrolled at login based on their UPN msiexec /I NSClient.msi host=addon- .[region.] token= enrollauthtoken= enrollencryptiontoken= mode=peruserconfig /qn Example 1: msiexec /I NSClient.msi host=addon-corp.goskope.com token=XXX enrollauthtoken=XXX enrollencryptiontoken=XXX mode=peruserconfig /qn Example 2: msiexec /I NSClient.msi host=addon-corp.eu.goskope.com token=XXX enrollauthtoken=XXX enrollencryptiontoken=XXX mode=peruserconfig /qn Microsoft Intune: In the “Command-line arguments” do not include msiexec /I NSClient.msi; only include the remaining parameters from the previous examples. To learn more, view Deploy Client On Windows Using Intune . Microsoft Endpoint Configuration Manager: You can deploy Netskope Client to Active Directory (AD) joined devices via Microsoft GPO using a script based or MST based deployment option. To learn more, view Microsoft Group Policy Object (GPO) VMware Workspace One: To learn more, view VMware Workspace ONE . To install and enable the Netskope Client for Netskope Private Access Prelogon connectivity, include the prelogonuser, enrollauthtoken, and enrollencryptiontoken parameters in the table referenced in the previous section . Prelogon Usernames are configured in Client Configurations. The Prelogon Username set in the MSIEXEC parameters must match an existing Client Configuration. msiexec /I NSClient.msi host=addon-<tenant-name>.[region.]<tenant-domain> token=<Organization ID> enrollauthtoken=<Authentication Token> enrollencryptiontoken=<Encryption Token> mode=peruserconfig prelogonuser=<prelogon user>@prelogon.netskope.com /qn Example with Client Configuration configured with Prelogon User user1@prelogon.netskope.com: msiexec /I NSClient.msi host=addon-corp.goskope.com token=XXX enrollauthtoken=XXX enrollencryptiontoken=XXX mode=peruserconfig prelogonuser=user1@prelogon.netskope.com /qn To learn more, view Configure Client Prelogon Connectivity Uninstall Netskope Client In Windows This section provides the instructions to uninstall Netskope Client from your Windows devices. You can uninstall using multiple methods such as manually from Settings in Windows, from command-line using MSIEXEC, and so on. Uninstall Manually To uninstall Client from Settings in Windows: Go to Start > Settings > Apps > Apps & Features . Find and select the Netskope Client app. Click Uninstall . You are prompted to enter your administrative credentials at this point. Click OK . The Netskope Client is uninstalled from your machine. You can check Apps & features under Apps to ensure that the Netskope Client is uninstalled from your device. To learn more about uninstalling Client from other features in Windows, view Uninstall Apps in Windows . The Password protection for client uninstallation and service stop option under Client Configuration > Tamperproof lets the administrator restrict unauthorized uninstallation of Client by the end users. The end user must know the password set by the administrator while uninstalling the Client. To learn more, view Netskope Client Configuration . Using MSI file From Command-Line To uninstall Client: Open a command prompt as an administrator. Enter the following command: msiexec /uninstall %productCode% PASSWORD=\"<password in plain text within quotes>\" /qn /l*v %PUBLIC%nscuninstall.log Use the following command to find the product code: wmic product where \"Name like 'Netskope Client'\" get IdentifyingNumber /value Use the same password that is configured under Tamperproof in Client Configuration. Using GPO Scripts Uninstalling can be done through GPO using a batch script similar to installation. The uninstallation script is: wmic product where name=\"Netskope Client\" call uninstall Using Script in SCCM @echo off REM REM This batch file is used to uninstall Password protected Netskope Client from SCCM REM SetLocal for /f \"tokens=2 delims==\" %%f in ('wmic product where \"Name like 'Netskope Client'\" get IdentifyingNumber /value ^| find \"=\"') do set \"productCode=%%f\" IF DEFINED productCode ( msiexec /uninstall %productCode% PASSWORD=\"<password in plain text within quotes>\" /l*v %PUBLIC%nscuninstall.log /qn ) ELSE ( REM Did not find product code for Netskope Client ) EndLocal Multilingual Support For Windows Netskope supports the following languages for end-user support: French German This helps non-english speaking users to understand Netskope Client menu and notifications. To display end-user Netskope Client notifications in French and German, modify your language and region settings in the Windows devices. To learn more about how to change your language and region settings in your Windows devices, view Manage display language settings in Windows . Windows Support For WSLv2 Netskope Client supports Windows Subsystem for Linux (WSL) version 2 that allows you to run Linux on your Windows devices without the need of a separate virtual machine. This enables a seamless and simultaneous usage of Windows and Linux operating systems. You can deploy Netskope Client for Linux onto a Linux distribution to extend Netskope services to wSLv2 Linux environment. Currently, Netskope Client extends only command-line interface (CLI) support for WSLv2. This is available only as Beta in version 113.0.0.Netskope Private Access will be available as Beta in 117.0.0. Periodic reauthentication is not supported with the CLI version of the Linux Client on WSLv2. To learn more, view Install Linux on Windows Using WSL . Support Versions Windows OS: Windows 10 and later versions. WSLv2 and Minor Version 0.67.6 or above. Netskope Client: Version 113.0.0 or later. Set the systemd flag set in your WSL distro settings. If systemd is disabled, turn on the flag and reboot the distro. Check the WSL version and Netskope Client does not support WSLv1. Limitations WSL Linux distribution contains no login name as it does not support UI desktop by default. This info only appears as an install log message and not used by Netskope Client features. Hence it does not impact any functionalities. The device manufacture information is not available in WSL Linux distributions. There is no file naming “/sys/devices/virtual/dmi/id/sys_vendor” that the manufacturer comes from. The information is for display only, it doesn’t impact any functionalities of the products. If Netskope Client for Linux is installed before the installation of applications such as Firefox and Chrome and so on, the WSL distro needs reboot to make the browsers working. Netskope Client Auto-Restart In instances where the user forgets to enable a Client after disabling it, Netskope set a feature flag AutoStart NSClient with Reboot/Relogin to enable the Netskope Client. After the administrator enables the feature flag, the Netskope Client is enabled after the user restarts the system or the user logs off and logs in again. Contact Netskope Support to enable this feature for your tenant. This feature is available only for Windows and macOS devices. Administrator cannot use this feature flag for NPA services. This re-enable feature of Netskope Client for SWG does not apply when the user puts the device in sleep mode. Netskope Client Auto-Upgrade Failures and Rollback In certain situations, the Netskope Client may be susceptible to various issues during the auto-upgrade process and the Client installer needs to handle the failure and revert to the previous version. Client Upgrade or Uninstallation Failure In the event of any upgrade/uninstall failures, the Netskope Client rollback to the previous version of the client thereby preventing the removal of the Client from the end-user device. In the event of a Client upgrade failure, the Client installer reverts to the previously installed version. In the event of a Client uninstallation failure, the Client installer reverts to the installed version. Important The auto-rollback during Client upgrade is available only from Client version 103.0.0 and later. For example, in the event of a failure during the Client upgrade from version 103.0.0 to 104.0.0, the Client automatically rollback to the version 103.0.0. However, the Client is removed for end-user devices running Client versions below 103.0.0. You can go to Settings > Security Cloud Platform > Netskope Client > Devices to view the events displayed during the Client upgrade failure. Click the device name to view the related events and the corresponding details. The following table lists the different events displayed in the event of a Client upgrade or uninstallation: Event Event Details Installed Installed client version ‘x’ Uninstalled Uninstalled client version ‘x’ Installation Failure Failed to install client version ‘x’ – < reason for failure> Uninstallation Failure Failed to uninstall client version ‘x’ – < reason for failure > Upgraded Upgraded from client version ‘x’ to ‘y’ Upgrade Failure Failed to upgrade from ‘x’ to ‘y’ – < Reason for failure > Rollback Success Rolled back to client version ‘x’ Rollback Failure Failed to rollback to client version ‘x’ Rollback Success, Upgrade Failure, Installed Rollback Failure Uninstalled, Uninstallation Failure Upgraded Client Upgrade Failure During System Restart/ Shutdown/ Hard Reboot/ Power Failure There are occurrences where the auto-upgrade processes gets impacted due to unplanned events such as: System restart Shutdown Crash Hard reboot Power failure To eliminate this issue, during the upgrade process, Netskope creates an installation monitor service stAgentSvcMon.exe that is a copy of the existing Netskope Client Services, with limited functionality. The installation monitor service relaunches the Client installation process on the end-user device whenever the auto-upgrade process is interrupted by system restart/crash/shutdown/hard-reboot/power failure. Once the auto-upgrade process is completed, this monitor service is removed from the endpoint. However, there are a few scenarios that would stop the monitor service from relaunching the Client installation process. Refer to the following table to learn more: Scenario Client Behavior Consecutive system restart during the auto-upgrade process The monitor service stops the auto-upgrade process after two attempts. The monitor service stops In case of improper upgrade, Installation monitor service reattempts to upgrade twice before ending the process. The auto-upgrade process fails and the system restart/crash happens during rollback phase The monitor service attempts to reinstall the new build. Antivirus configurations to block new processes The copy of the Client services is not launched. MSIEXEC behavior during upgrades Somtimes, MSIEXEC may restart the system during this process. Private Access Tunnel Status Update in Windows Registry Private Access service on Netskope Windows Client updates the status of the tunnel in the following registry location: HKEY_LOCAL_MACHINE\\SOFTWARE\\NetSkope\\NpaTunnel/NpaStatus Status Descriptions Tunnel Status Registry Value Enabled Connected Disabled Disconnected In addition, the timestamp at which this status change was made is updated in the following registry location: HKEY_LOCAL_MACHINE\\SOFTWARE\\NetSkope\\NpaTunnel/NpaStatusLastChanged.",
  "content_length": 18890,
  "crawl_timestamp": 1750780985.03659
}