{
  "url": "https://docs.netskope.com/en/netskope-security-cloud-product-life-cycle-policy/",
  "title": "Netskope Product Life Cycle Policy - Netskope Knowledge Portal",
  "content": "Purpose. As a leader in cloud security technology, Netskope is committed to improving its products and services through continuous innovation. As part of this commitment, Netskope has developed this Netskope Security Cloud Product Life Cycle Policy (“ Policy ”) to assist customers and partners in planning and successfully transitioning to current versions by providing clarity regarding the Netskope Security Cloud product lifecycle, including the announcement of End of Availability and End of Life stages. Customers will be notified of applicable dates through official communication channels, including email and the Netskope customer support portal. Notifications will include key dates, anticipated impacts on service, and recommended actions for customers. Scope. This Policy applies to Netskope’s Security Cloud subscription services and associated software, excluding Netskope Borderless SD-WAN products and services. Netskope may, at its discretion, update and modify this Policy by posting new terms, to be effective with respect to purchases and renewals of Cloud Subscription Services after new terms are posted. For lifecycle information relating to Netskope’s Borderless SD-WAN hardware, software and subscription services, please refer to the Netskope Borderless SD-WAN Life Cycle Policy at https://www.netskope.com/netskope-borderless-sd-wan-life-cycle-policy . Cloud Subscription Services. For Cloud Subscription Services, the following applies: Netskope will use commercially reasonable efforts to provide 3 months notice prior to a Cloud Subscription Service’s EOA, at which time the service will no longer be available for order. Netskope will continue to provide support for a Cloud Subscription Service until the EOL for the service. EOL will be 12 months from the date of the EOA announcement. For example, if EOA is Jan 2025, then EOL will be Jan 2026. For customers who have a valid subscription for a Cloud Subscription Service at the time of the EOA announcement: Existing customers may continue to renew their subscription or purchase more users/capacity up until the EOL date. After EOL, the Cloud Subscription Service will no longer be available. For customers who have a valid subscription for a Cloud Subscription Service that extends beyond the EOL date, Netskope will provide the customer with an upgrade path or replacement of the Cloud Subscription Service with products of substantially the same functionality, or support the then current Cloud Subscription Service subscription until the end of the subscription term without renewal. Software. For client software and other software that is designed to provide access to Cloud Subscription Services (“ Software ”), the following applies: Each Software Major and Minor feature release will be supported for a specified duration from the date of release in accordance with the specific policy below. Software support may include Updates, Hotfixes, and correction of Errors. NS Client Support policy https://support.netskope.com/s/login/?ec=302&startURL=%2Fs%2Farticle%2FDownload-Netskope-Client-and-Scripts . NPA (Publisher) Support policy /en/publisher-support-policy/ . Virtual Appliance Support policy /en/requirements-for-virtual-appliance-version-117-0-0/#appliance-software-version-support . Following the EOA date for a Software release, Netskope will continue to provide support for 6 months leading up to the EOS date. During the period between EOA and EOS dates, the Software release will receive limited support, including critical security patches and major bug fixes only. No support will be provided after the EOS date, and customers will be responsible for any issues that arise. Customers are encouraged to upgrade to the latest supported version before the EOS date for continued security and support. Correction of an Error may require implementation of a currently supported Update in accordance with Netskope’s standard support terms. Definitions. For the purposes of this Policy, the following definitions apply: Cloud Subscription Service means the online, Web-based applications provided by Netskope on a subscription basis, excluding those subscriptions identified as a Borderless SD-WAN cloud subscription on an order. Documentation means Netskope’s published specifications and documentation for the Cloud Subscription Services and Software in effect as of the date the Cloud Subscription Services are purchased, as such specifications and documentation may be updated or revised by Netskope. End of Availability (“ EOA ”) means the last day that a Cloud Subscription Service will be available for order from Netskope. For Software, EOA refers to the last day that a Software release is made available for download by Netskope. End of Life (“ EOL ”) means the last day that a service or software will be supported by Netskope. For Cloud Subscription Services, EOL refers to the last day the cloud service would be accessible for use. For Software, EOL refers to the date after which technical support and updates (including security patches) will no longer be provided, and may require implementation of a current release for continuing access to Cloud Subscription Services. End of Support (“ EOS ”) means the last day that a Software release will be supported by Netskope. Error means an identified error or fault in the Software that causes a failure of the Software to perform in accordance with the Documentation. Hotfix means a planned software change that is done to address a specific bug or to patch vulnerabilities. Hotfixes do not have a specific frequency and are done on an as-needed basis. Life Cycle Policy means this Policy covering End of Availability announcement through End of Life for a Cloud Subscription Service and Software. Major feature release means where each release includes three numbers (x.y.z): The “x” represents a major feature release, which usually includes a large number of new features and/or significant software architectural changes. Minor feature release means the “y” in the x.y.z nomenclature above represents a minor feature release, which usually includes a small to medium number of new features and typically minimal software architecture changes. Updates means updates and new versions of Software, if and when available, that Netskope generally releases from time to time to customers without additional fees. Updates may include new features required to support functionality in the Cloud Subscription Services or Hotfixes. Last updated: September 20, 2024",
  "content_length": 6523,
  "crawl_timestamp": 1750779882.549867
}