{
  "url": "https://docs.netskope.com/en/netskope-client-supported-os-and-platform",
  "title": "Netskope Client Supported OS and Platform - Netskope Knowledge Portal",
  "content": "This article describes the versions that are supported for each operating system. The following table lists only the major versions for each platform and does not display the minor versions. Netskope support claim is inclusive of all minor versions for the major versions listed here. Category Supported Versions Notes Windows Operating System Desktop Windows 10, Windows 11 Windows 365 Server Windows Server **2012 R2, 2016, 2019, 2022, 2025 Netskope Private Access (NPA) is supported for devices running Windows 11 on Snapdragon-based PC. Cloud Access Security Broker(CASB) or Security Web Gateway (SWG) is supported on Windows 11 with the Snapdragon chipset. **There are a few limitations for Netskope Client support with Windows 2012 R2: Protect Client configuration and resources option is not supported. All Traffic steering modes are not supported. Netskope Client falls back to the Web Traffic mode if All Traffic is selected in the Steering Configuration. Do not support auto-upgrade of Netskope Client. Apple macOS / iOS macOS 13(Ventura), 14(Sonoma), 15(Sequoia) iOS 15.1, 16, 17, 18 With macOS Ventura, Netskope has validated traffic steering and general Netskope Client functions. Netskope also observed a few known issues with macOS Ventura running as a virtual machine. To learn more, view Support for macOS Ventura . Netskope supports Apple x86, M1, M2, M3, and M4 chipset hardware. macOS 15 (Sequoia) is supported only from version 120.0.0 or higher Linux Ubuntu 22.04, 24.04 LTS desktop version Linux Mint Desktop Versions 21 (Cinnamon Edition) Red Hat Enterprise Linux version 9.4 ( Plow) Netskope Cloud Firewall (CFW) is not supported on Netskope Client for Linux. Netskope Private Access (NPA) now supports Ubuntu 24.04. System reserved domains like .local for Private Apps are not supported on Ubuntu. Netskope also supports WSLv2(Beta). Netskope announces end-of-support for Ubuntu 20.04 and Linux Mint versions 19 and 20 by May 31, 2025. To learn more, view End-of-support for Linux versions . Google Android 12 (Snow Cone), 13 (Tiramisu), 14 (Upside Down Cake), 15(Vanilla Ice Cream) ChromeOS ChromeOS 120 and above Android Runtime Version 9, 11 Netskope Client does not support ARM32 based Android devices. Cloud Firewall(CFW) is not supported on the Netskope Client for Android devices. Netskope Private Access periodic re-authentication is not supported on Android and Chromebook. Multi-user Platforms Windows Terminal Server 2016, 2019, 2022 VDI Citrix Xen Desktop, XenApp 7.13 (Supported OS: Windows 2019, Windows 10 (Single Session), Windows Server (Multi Session) Azure Virtual Desktop (Supported OS: Windows 10 and 11) Netskope Private Access now supports multi-user virtual desktop environments based on Windows, such as Citrix VDI and Azure Virtual Desktop. – Netskope ended extending support for a few operating systems. To learn more, view Netskope Client End of Support Announcement for Older OS Versions . – See the Netskope Client Interoperability topic to learn more about Netskope Client compatibility with third-party apps.",
  "content_length": 3066,
  "crawl_timestamp": 1750780523.6384451
}