{
  "url": "https://docs.netskope.com/en/netskope-help/getting-started/netskope-success-resource-center/observe-cloud-app-activities-oplp-and-risk-insights/visibility-on-data-movements-to-and-from-cloud-services/",
  "title": "Visibility on data movements to and from cloud services - Netskope Knowledge Portal",
  "content": "Value to the customer: Enhanced Security, improved visibility, compliance with regulatory requirements For SkopeIT analytics about applications, go to SkopeIT™ > Applications in the Netskope UI. This page helps you manage your apps, create policies, plus analyze and export app information. The Applications and Categories tabs show this summary information: Applications: The app name, with links to more details about the app, like CCI level, incident information, etc. Category: Software group, like Cloud Storage, Development tools, etc. Refer to Category Definitions for more information Sanctioned: Sanctioned or not distinctions for each app (Application tab only) CCL: Cloud Confidence Level score for each app (Application tab only) Users: Total number of users per app, with links to each user’s details Sessions: Total number of sessions per app Total Bytes: Total amount per app Bytes Uploaded: Total amount per app Bytes Downloaded: Total amount per app To update the page with the most current information, click the Refresh icon next to the page title. To change the columns shown, click the gear icon on the right and select the columns to show on each tab. You can filter items shown on the page by adding a filter, selecting a date range, and sorting per column. To see SkopeIT events per app, select one or more listings and click View Events , and then select Application Events or Page Events . To create a policy, select items and click Create Policy , which adds application specifics to the policy for you. To export application analytics information to a spreadsheet, click Export CSV . The bottom of the page allows you to go to subsequent pages and increase the number of rows shown per page. Click here to understand Risk Insights.",
  "content_length": 1759,
  "crawl_timestamp": 1750781342.8017302
}