{
  "url": "https://docs.netskope.com/en/netskope-client-enrollment-methods/",
  "title": "Netskope Client Enrollment Methods - Netskope Knowledge Portal",
  "content": "The final step in the Netskope Client deployment workflow is User Enrollment. User Enrollment allows Netskope Client to be assigned to a specific user (or multiple users) enabling per-user configuration customization. The enrollment process includes four methods: IDP UPN Email Invite PLIST IdP Enrollment Method Using this method, the user is authenticated against IDP before enrolling in the Netskope Client. Netskope supports the following IDP methods: Okta Microsoft Entra ID To learn more, view User Provisioning and Authentication . Community Supported Apps OneLogin PingOne Prerequisites Refer here to understand the prerequisites for Netskope Client deployment. Advantages Requiring a user password during enrollment ensures that the actual user is completing the process and prevents potential impersonation attacks. Leveraging the security features of IDP, such as strong authentication mechanisms and password policies, provides a higher level of trust for enrolled devices. Enabling multi-factor authentication (MFA) during the enrollment phase adds a second layer of verification, offering protection even if the user credentials are compromised. Disadvantages Typically not a silent deployment. Requires integrated Windows authentication configured with IDP for silent deployment. NPA Pre-logon requires users to be authenticated at least once. In a non-SSO environment, before the user enrolls, Fail Close is not enforced. UPN Enrollment Method Using this method, the user machine is joined to Active Directory or LDAP directory integration. The Netskope Client monitors the Directory Service to identify the user by their User Principal Name. Prerequisites For user authentication and successful enrollment, add Secure Enrollment token(s) in the MDM configurations. To learn more on tokens: Secure Enrollment . Advantages Organizations can easily adopt as user enrollment is transparent to the end user. Works seamlessly with the AD environment. Disadvantages Requires an authentication token deployment that administrators ensure are distributed properly and prevent any token compromises. Requires periodic token maintenance by the admin. Email Invite Install Netskope Client using the email invitation sent from the Netskope admin console. The user can click the link to download and install Client (or mobile profile) on their device. To learn more, view Email Invite . Prerequisite Import a user with a valid and accessible email into the tenant. To learn more, view Prerequisites to deploy Client through Email Invite . Advantages The admin need not share any user authentication parameters for enrollment. Send Email Invites for corporate and personal Email IDs. Quick way to deploy for BYOD users. Disadvantages The user requires admin rights to install the Client software. Misuse of the Email by forwarding it to the unintended recipients. Download installation package name contains the org key and the activation key (not secure). Enrollment Methods Comparison Idp Upn Email Invitation Plist User Identification User Email address UPN Userkey Email Address User Authentication Through the configured IdP Legacy - OrgKey Current - Authentication Token part of Secure enrollment User activation key (One-time token) Legacy - OrgKey Current - Authentication Token part of Secure enrollment User Experience Requires user interaction No user interaction User needs admin rights to deploy No user interaction Security Supports the security levels setup for IdP such as MFA Uses the same authentication and encryption token across organization One time token distribution through Email Lacks control on the distribution of the Email invitation Uses the same authentication and encryption token across organization Domain-Joined Not required Requires to be domain-joined Not required Not required",
  "content_length": 3816,
  "crawl_timestamp": 1750780790.718702
}