{
  "url": "https://docs.netskope.com/en/netskope-one-for-microsoft-purview-dlp",
  "title": "Netskope One for Microsoft Purview DLP - Netskope Knowledge Portal",
  "content": "To use this feature, please get in touch with the Netskope account team to get this feature enabled on your tenant. If you are a new customer, please reach out to the Netskope sales team. Netskope One for Microsoft Purview DLP allows customers to leverage their existing Purview to gain visibility and control over sensitive data in motion, including activities like AI interactions, data shared on unsanctioned platforms, or social media form posts. All traffic passing through Netskope will be directed to Purview. Customers can utilize either existing or new Purview collection policies to enhance visibility, extending from applications and endpoint traffic to include network traffic as well. Use Cases include: Gen AI Discovery : Engage with Generative AI through various platforms, including browsers, applications, and add-ins like Chat GPT, Gemini, and Claude. This integration will capture comprehensive evidence of these interactions within Purview, enhancing compliance features such as eDiscovery, data retention, deletion, and communication compliance. Protection : Identify sensitive content in files uploaded to unauthorized cloud storage applications like Box, Dropbox, and Google, or shared via public email providers such as Gmail and Outlook and monitor sensitive information submitted through form services, including Google Forms. Centralized Visibility : Access all Purview classification activities from a single dashboard, empowering you to make informed decisions. Insider Risk Management : For instance, if a user engages in multiple risky activities and begins sharing sensitive information with ChatGPT, their risk level may escalate which could necessitate actions such as restricting access to sensitive information in Teams or SharePoint. Conditional Access : With Entra conditional access, customers can manage access to the tenant and SSO-configured applications, regardless of the user’s login location. For example, customers can permit sign-ins from a home PC as long as the user is deemed low risk. Additionally, adaptive protection offers benefits like triggering the retention of OneDrive content based on risk levels. Prerequisites Entra ID / Azure AD (AAD) – The current integration for Purview is only supported through Entra ID / Azure AD. In Entra ID, the user email field should be populated as that is the unique identifier for Netskope. User provisioning with Entra ID : This feature integrates Microsoft 365 and Netskope, therefore the users must be synchronized between Entra ID and Netskope. To do this, you must enable Entra ID user provisioning within Netskope . Client installation: The Netskope client must be installed on a machine & registered to an account that is synced from Entra ID. For more information, see Netskope Client . If testing on a test tenant separately, follow the steps mentioned on Netskope Client to install the client. If testing on a production tenant, follow the Purview Instance setup steps below. Netskope One for Microsoft Purview DLP Configuration Netskope One for Microsoft Purview DLP Troubleshooting and FAQ",
  "content_length": 3095,
  "crawl_timestamp": 1750780351.1468449
}