{
  "url": "https://docs.netskope.com/en/netskope-client-for-ios",
  "title": "Netskope Client for iOS - Netskope Knowledge Portal",
  "content": "The iOS client App is intended to offer Netskope security services in a single client for the iOS phones and tablets (iPad). The iOS Client app supports Netskope security services such as Cloud Access Security Broker (CASB), Secure Web Gateway (SWG), Netskope Private Access (NPA), and Netskope Cloud Firewall (CFW). This document describes the various methods to install Netskope Client on an iOS device and how to configure and steer traffic to the Netskope Cloud. Supported Versions Refer to Netskope Client Supported OS and Platform to understand the supported versions for iOS. Prerequisites iOS version 15 and above. Configure steering exceptions . Refer Apple Support article to configure steering exceptions for traffic from Apple. Client Installation Methods You can install Netskope Client in iOS using one of the following methods: Email invite Other deployment options Netskope Client for iOS does not coexist with any third-party VPN applications due to an iOS limitation that stops an existing service when a new service is started. Email Invite Deployments through an email invite is a two step process: iOS Profile link: This installs tenant certificates on the device. They are necessary for SSL Decrypt related functionality. This profile contains only certificates. iOS Client link: Helps to find the client in the App Store and enroll it after installation. – iOS Client in the email is a one time installation only link. You will receive an error message Email Invitation Expired the second time you attempt to use the link after installing Netskope Client. – If you are unable to see the link to download Netskope Client for iOS in the email invite, use the default email template that includes the link to download Netskope Client for iOS. After you receive the email: Check your email from Netskope Onboarding and click iOS Profile to install the profile with certificates to your iOS device. Click Allow for the pop-up This website is trying to download a configuration profile. Do you want to allow this? Close the pop-up after the profile is downloaded. In your iOS device, go to Settings app > General and tap Profile Downloaded . The profile consists of the root and tenant certificates. Tap Install in the upper-right corner. Follow the installation instructions displayed on the screen. Go to Settings > General > About > Certificate Trust Settings . Tap to enable the option Enable Full Trust to Root Certificates . Click Continue to close the warning. Click the iOS Client link in the email invite. This opens a page with two links and perform the following steps: Click Install to download Netskope Client from Apple Store to iOS devices. Perform the following instructions: Click Allow to add VPN configurations. Wait for the Client enrollment. Click Download iOS configurations to complete the enrollment process. Follow the enrollment steps as displayed on your screen. After completing the enrollment steps, go to VPN & Device Management . Check whether VPN displays the Connected status to ensure the successful installation of the iOS configuration profile. Verify Client Enrollment After completing the enrollment process, you can verify the iOS Client installation on your iOS device and in the Netskope account. On your iOS device , Verify Netskope Client’s Internet Security is enabled on the Client app home page. Verify the configuration details are correct on the client app Configuration page. On your Netskope User Interface , Log into your Netskope account. Go to Settings > Security Cloud Platform > Devices . The Devices page displays the hostname of your iOS device along with the username. Other Deployment Options You can install Netskope Client in iOS using one of the following MDM/EMM plaftforms: VMware Workspace ONE Microsoft Intune Jamf School Jamf Pro Ivanti Neurons Prerequisites In the Netskope UI, go to Settings > Security Cloud Platform > Netskope Client > MDM Distribution . Download the Netskope Root Certificate. These are needed to configure Intune certificate profiles. User accounts provisioned within MDM/EMM platform must match with those provisioned with the Netskope tenant. Netskope Client Uninstallation To uninstall Netskope Client in an iOS device: Tap and hold the Netskope Client icon. A pop-up is displayed and tap Remove App . The Netskope Client application is removed successfully. SSL Inspection for iOS SSL/TLS inspection is a foundational capability that enables Netskope to perform efficient threat and data protection services. Netskope performs SSL inspection and serves as a Man-in-the-Middle. In order to establish trust between source applications and Netskope it is required to install CA certificates into appropriate OS stores. To learn more, view Certificates for SSL/TLS Inspection . SSL decryption policies allow you to specify the traffic you want to leave encrypted and not further analyzed by Netskope via the Real-time Protection policies. To learn more, view SSL Decryption . You can also configure specific steering configurations required for SSL decryption. To learn more about the steering configurations, view Certificate Pinned Applications . The administrator can enforce the following deployment modes for personal and corporate owned iOS devices: Per App VPN On Demand VPN The Per App VPN is suitable for personal or BYOD devices. Netskope steers traffic only from the managed applications administered through MDMs in a device. For corporate devices, Netskope recommends On Demand VPN as it steers all traffic from the device. However organizations can use Per App VPN for corporate devices for better navigation around SSL inspection challenges. Best Practices For Per App And On demand VPN It is a best practice in both Per App and On Demand VPN to control application inventory and test SSL inspection compatibility before introducing a new application. The ability to install arbitrary apps with personal Apple ID in corporate devices can significantly increase operational costs on maintaining SSL inspection exemption policies. Apps must be vetted beforehand and they can be used for deployment using MDM (optional) after making the required configurations. Best Practices For Per App VPN With Safari Disable Safari on corporate devices and rely on a managed browser associated with Per App VPN. For BYOD – keep Safari in personal space, deploy a managed browser and associate it with Per App VPN. Enforce device restrictions policies on MDM that controls data movement from managed to unmanaged apps. Share Logs From iOS App This section explains how to collect logs for Netskope Client for iOS using an iOS app. On your iOS device, go to Client app home page. Tap the Settings icon. On the Settings screen, tap Share Log . You can now share logs to the desired location as displayed on your screen. Limitations The following are a few limitations pertaining to Netskope Client for iOS: The VPN logo is visible on the status bar of your iOS device. This is an iOS limitation. Per-app VPN and Global VPN coexistence is not supported. NPA do not support UDP-based private apps, Secure DNS, DoH and DoT. Do not support user notifications in iOS.",
  "content_length": 7166,
  "crawl_timestamp": 1750780665.352601
}