{
  "url": "https://docs.netskope.com/en/oplp-alerts-and-event-descriptions",
  "title": "OPLP Alerts and Event Descriptions - Netskope Knowledge Portal",
  "content": "This document provides a complete list of OPLP alerts, their description, the required user action, and the SNMP trap notifications that the appliance generates when SNMP traps are enabled. Alerts with a priority “None” are recovery alerts. “Medium” priority alerts are warnings and “High” priority alerts are critical. ​ Alert Priority Description User Action Snmp Trap Notification Device_rebooted None Device was rebooted. Check the status of services by running show service-status deviceRebootedNotif Device_rebooted High Device rebooted. Check the status of services by running show service-status deviceRebootedNotif Storage-root-partition None Disk usage of the root partition is below 75%. Check the available disk size of the root partition. From the Linux shell, run the command: df -h storageRootNotif Storage-root-partition Medium Disk usage of the root partition is at 75% or more. Check the available disk size of the root partition. From the Linux shell, run the command: df -h storageRootNotif Storage-root-partition High Disk usage of the root partition is at 90% or more. Check the available disk size of the root partition. From the Linux shell, run the command: df -h storageRootNotif Storage-securestore-partition None Secure Store disk usage is below 75%. Check the available disk size of the Secure Store disk using the “df” command. To increase the size of the partition contact support. Storage-securestore-partition Medium Secure Store disk usage is is at 75% or more. Check the available disk size of the Secure Store disk using the “df” command. To increase the size of the partition contact support. Storage-securestore-partition High Secure Store disk usage is is at 90% or more. Check the available disk size of the Secure Store disk using the “df” command. To increase the size of the partition contact support. Storage-lcmysql- partition None Disk usage of lcmysql is below 75%. Check the available disk size of the lcmysql partition using the “df” command. To increase the size of the partition contact support. storageMysqlNotif Storage-lcmysql- partition Medium Disk usage of lcmysql is at 75% or more. Check the available disk size of the lcmysql partition using the “df” command. To increase the size of the partition contact support. storageMysqlNotif Storage-lcmysql- partition High Disk usage of lcmysql is at 90% or more. Check the available disk size of the lcmysql partition using the “df” command. To increase the size of the partition contact support. storageMysqlNotif Storage-lcmongo- infrastructure- partition None Disk usage of lcmongo-infrastructure is below 75%. Check the available disk size of the lcmongo-infrastructure partition using the “df” command. To increase the size of the partition contact support. storageMongoInfraNotif Storage-lcmongo- infrastructure- partition Medium Disk usage of lcmongo-infrastructure is at 75% or more. Check the available disk size of the lcmongo-infrastructure partition using the “df” command. To increase the size of the partition contact support. storageMongoInfraNotif Storage-lcmongo- infrastructure- partition High Disk usage of lcmongo-infrastructure is is at 90% or more. Check the available disk size of the lcmongo-infrastructure partition using the “df” command. To increase the size of the partition contact support. storageMongoInfraNotif Storage-lclw-partition None Disk usage of lclw is below 75%. Check the available disk size of the lclw partition using the “df” command. If required, increase the disk partition using the command troubleshooting expand-partition log storageLogNotif Storage-lclw-partition Medium Disk usage of lclw is at 75% or more. Check the available disk size of the lclw partition using the “df” command. If required, increase the disk partition using the command troubleshooting expand-partition log storageLogNotif Storage-lclw-partition High Disk usage of lclw is at 90% or more. Check the available disk size of the lclw partition using the “df” command. If required, increase the disk partition using the command troubleshooting expand-partition log storageLogNotif Storage-lckafkabroker- partition None Disk usage of lckafkabroker is below 75%. Check the available disk size of the lckafkabroker partition using the “df” command. To increase the size of the partition contact support. storageKafkaBrokerNotif Storage-lckafkabroker- partition Medium Disk usage of lckafkabroker is at 75% or more. Check the available disk size of the lckafkabroker partition using the “df” command. To increase the size of the partition contact support. storageKafkaBrokerNotif Storage-lckafkabroker- partition High Disk usage of lckafkabroker is at 90% or more. Check the available disk size of the lckafkabroker partition using the “df” command. To increase the size of the partition contact support. storageKafkaBrokerNotif Rows per page: ​ 1-20 of 81 Outboard Ports Use these ports for management connectivity and log uploads. For management connectivity: Domain Description Port config- Use for configuration updates. The domain needs to be SSL allowlisted if you have SSL decryption enabled. 443 download- Use for software upgrades. 443 messenger- Use for reporting and status updates in the UI. The domain needs to be SSL allowlisted if you have SSL decryption enabled. 443 callhome- Use for receiving metrics from on-premises appliances and forwarding them to cloud tenants, as well as receiving event data from an on-premises dataplane appliances. Also for receiving custom user attributes from user endpoints. The domain needs to be SSL allowlisted if you have SSL decryption enabled. 443 For log uploads: Domain Description Port upload- Use for sending logs to the Netskope cloud with SFTP. This is the default port for log uploads. 22 logupload- Use for sending logs to the Netskope cloud with HTTPS. This port is enabled by default. 443 Use for fetching the REST API token with HTTPS. 443",
  "content_length": 5922,
  "crawl_timestamp": 1750780822.392252
}