{
  "url": "https://docs.netskope.com/en/publisher-support-policy/",
  "title": "Publisher Support Policy - Netskope Knowledge Portal",
  "content": "Netskope One Private Access (NPA) Publisher is a software package that is deployed in your data center. The Publisher enables the private application connectivity between your data center and the Netskope cloud. Various supported platforms and versions are explained in Deploy a Publisher . Netskope periodically introduces Publisher software versions that offer enhancements and additional capabilities. For compliance with the Netskope Service-Level Agreement (SLA), you are required to update your Publisher software periodically. You can either update Publisher software manually or enable the Publisher Auto-Update function. As part of the software update process, Netskope will attempt to update the Publisher software package, Host OS, and OS Kernel as applicable. For information about Publisher management and upgrade instructions, go to Manage a Publisher . Publisher Software Support Model Netskope will support the latest (N) version and two previous versions (N-1 and N-2) of the Publisher software. Here N refers to the Publisher’s software version number, corresponding to a Netskope Cloud release. For example, if the latest Publisher version is 107.0.0.1, Netskope will support versions 106.0.0.1, and 105.0.0.1. Support will not be offered for releases such as 104.0.0.1, etc. Updates for software defects and security vulnerabilities will only be introduced in new software versions. Netskope will not back port software updates to older supported versions. You should consider upgrading your Publishers to the latest version to take advantage of enhancements and security updates. For information about using 3rd-party applications with the Publisher, go to Guidance for Installing 3rd-party Applications on Publishers . CentOS-based Publisher Support End of Life Starting with release 105 (end of May 2023), Netskope Private Access will stop supporting CentOS as the base OS for Publishers and only support Ubuntu-based Publishers. Ubuntu provides an improved security posture from available CIS benchmarks for Linux distros, and Ubuntu also enables the Auto-Update capability for Publishers. Netskope recommends that you replace existing CentOS Publishers with Ubuntu Publishers using one of these methods. Method 1 You can generate a new token for an existing CentOS Publisher and use that to register a new Ubuntu Publisher. This will expire the previous registration for the existing CentOS Publisher and replace it with the Ubuntu Publisher. With this method, you do not have to update the App Definitions that reference the existing CentOS Publishers. Method 2 You can configure new Publishers, add them to the App definitions, and then remove the existing CentOS Publishers in the App Definition. Considerations Ubuntu Publishers have feature parity with CentOS Publishers and do not have any capability limitations. You can use a mix of CentOS and Ubuntu Publishers simultaneously for application access during this move to Ubuntu only support.",
  "content_length": 2973,
  "crawl_timestamp": 1750780247.891382
}