{
  "url": "https://docs.netskope.com/en/quick-start/",
  "title": "Quick Start - Netskope Knowledge Portal",
  "content": "There are two fundamental steps required to deploy Netskope in your environment: Add Users and Groups to the Platform This is typically done by integrating with your Identity Service (like Microsoft Entra ID, Okta) using SCIM (API), or synchronizing your on-premises Active Directory using the Directory Importer Tool. Having users and identity attributes in the Netskope platform is critical for two reasons: Traffic is tied back to user identity; allowing you to have visibility on who is accessing what within your organization. Policies are primarily centered around user identity attributes, like Block and Allow. Deploy the Netskope Client to Devices There are numerous methods to steer traffic to the Netskope cloud for enforcement, but the primary one is the Netskope Client. This is a piece of software deployed to a user’s device that will: Automatically connect to the closest Netskope POP and forward all internet-bound traffic for inspection and enforcement. Attribute traffic entering and leaving the device with the identity of the user. The Netskope Client is incredibly lightweight as all inspection happens within the Netskope cloud: There is no traffic processing that occurs on the user machine. The default configuration of the Netskope Client is to steer web traffic to Netskope for inspection, so there is no baseline configuration needed to get the Client to function out of the box. Using this Guide This guide covers everything that a typical enterprise will need to do to get Netskope up and running effectively in your environment, including: Accessing the Netskope tenant (Admin Console) Ensuring that your firewalls allow the Netskope Client to connect Ensuring that you have the traffic steering bypasses you need in place Customizing the configuration of the Client. In this Guide Access the Admin Console Create Local Administrators Integrate an Identity Provider (IdP) Check Firewall Policy Bypass Netskope from your VPN Configure a Steering Profile Add Bypasses in Netskope Configure Netskope Client Settings Deploy the Netskope Client Allowlist the Netskope Client Validate Traffic Steering Create and Validate a Security Policy Next Steps",
  "content_length": 2175,
  "crawl_timestamp": 1750780027.3533561
}