{
  "url": "https://docs.netskope.com/en/requirements-for-virtual-appliance-version-117-0-0/",
  "title": "Virtual Appliance Release Notes Version 117.0.0 - Netskope Knowledge Portal",
  "content": "This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Requirements for Virtual Appliance Version 117.0.0 Upgrading to version 117.0.0 Before downloading the upgrade package, ensure the following: You are running a minimum version of 110.0.0. If you are running appliance versions older than 110.0.0, or if the root (/) partition is less than 64 GB, you must deploy a new Virtual Appliance and import configurations from the old appliance. To learn more: Install a Virtual Appliance . Note If your Virtual Appliance uses a 64 GB root (/) partition, then you must ensure that at least 8 GB of free space is available before upgrading. There is at least 42 GB of free space on the /opt/ns/upgrades partition where the upgrade package is downloaded. You can delete older versions of the appliance from the upgrades folder to free up disk space. To learn more: Upgrade the Virtual Appliance . All the dhcp interfaces on the appliance are configured with a static IP, netmask and gateway. Export the current appliance configurations to a different host. To learn more: Exporting Configurations . To verify that the host is reachable, run the following telnet command. nsappliance> telnet host cz.archive.ubuntu.com port 80 Executing telnet as: ['telnet', 'cz.archive.ubuntu.com', '80'] Trying 217.31.202.63... Connected to mirror-r-01.nic.cz. Escape character is '^]'. The following are the minimum hardware requirements to install and run the Virtual Appliance. Component Requirements Physical RAM 32 GB Processor 8-Core Hard disk space 400 GB is the total disk space required across all partitions. This includes 96 GB for storing and processing logs and 304 GB for the root partitions which store the Netskope software, configuration files, and data files. You must increase the disk capacity depending on the size of the logs that are processed daily. For information on increasing the partition size, see “Increase the Size of the Partition” under Optional Configurations topic on the Knowledge Portal . Note Netskope recommends that you increase the disk capacity by 5 times the expected daily log collection size. Appliance Software Version Support Netskope Appliance software releases are available every 4-months and will have Netskope support up to two previous versions. Direct software upgrades are supported as long as the “from” and “to” software releases are within two versions apart. Netskope appliance releases are numbered in the form of X.X.X.X where the Xs represent the major, minor, hotfix, and build release numbers, respectively. For example, appliance release 106.0.0.379 and older releases are deprecated when appliance release 117.0.0 goes live. Release numbers are not sequential like 101, 102, and 103. Instead, release numbers jump numerically, like 110.0.0, 113.0.0, and 117.0.0, to reflect parity with the Netskope Cloud Releases. The following table provides the upgrade path to the latest software version. Current Version Upgrade To Version Any version before 110.0.0 110.0.0 110.0.0 117.0.0 113.0.0 117.0.0 Releases that are outside the Netskope support period: Are not guaranteed to work with the latest cloud releases. Are no longer tested by Netskope. Do not receive hotfixes. Do not receive new feature updates. At our discretion, we may provide support for releases outside our support period. If a customer encounters an error in a version of software that is other than the latest release, Netskope may require the customer to upgrade to a specified later version to obtain a correction of the error. Hash Values for Virtual Appliance Installation Files The following table provides the md5sum and sha256sum values for the Virtual Appliance installer files on VMware ESX, Microsoft Hyper-V, and Linux KVM platforms for version 117.0.0. File Type Md5sum Sha256sum ESX OVA 46938ca396ca2c78416591b10b6dec69 38b0f1d47d32b835ba80f19af56755c91a5c124c77def58244e8cf283ea3cf20 Hyper-V Image 486b9dc07dabe54b4f229141560a3e0b 98902dccd4e058b022e599899bb7fe2d3fbf00e41bb0f14390c3a9ff151423c9 KVM Image d284cde96da0c6970af4fc2f0cb2a5f9 8316b2c3e97cb0fd2aa95f4f26252b4cc57ca284d08509130487eaad3aef9f5a Netskope MIB File The following is the Netskope MIB file for 117.0.0: NETSKOPE-APPLIANCE-MIB-APL117 Download",
  "content_length": 4326,
  "crawl_timestamp": 1750780244.4950342
}