{
  "url": "https://docs.netskope.com/en/troubleshooting-guide-for-ios-netskope-client-app",
  "title": "Troubleshooting Guide for iOS Netskope Client App - Netskope Knowledge Portal",
  "content": "Introduction This guide is designed to streamline the troubleshooting process with the MDM-based deployments. Prerequisites No specific prerequisites to follow the troubleshooting guide. Troubleshooting Scenarios This section provides a common scenario that you can troubleshoot when you set up Netskope Client for iOS devices using MDM. Scenario: Client Enrollment Fails After MDM Pushes the Client Configuration Problem 1: The enrollment process starts after you add the Netskope Client app from the public store in the MDM. In the MDM, you can configure the required configurations to enroll Client to the respective user endpoints. The enrollment failure denotes either one of the following: The Netskope Client failed to receive the required details. The Netskope Client received incorrect information. Solution: You can verify the following details in your MDM to rectify this issue: The configuration object carrying enrollment data (either App Configuration or VPN profile) is delivered to the device. The configuration object has appropriate assignments in MDM. The keys name syntax match the following: OrgKey AddonHost UserEmail Delete and recreate configuration objects carrying enrollment data from MDM and repeat correct assignments. Unenroll device if possible and delete or redeploy Netskope Client along with other associated configuration objects. Problem 2: The enrollment fails even after the Netskope Client receives accurate enrollment data with the correct key names. Solution: In such cases, tap the Netskope Client icon in the top-right corner of your screen and tap Configuration . In the event of a configuration failure, the following screen is displayed: Click the Update again link to retry the configuration update. If there is no progress in the update for more than five minutes, it indicates that the enrollment values are incorrect. You can verify the following details to rectify the issue: Enrollment key value data type are strings (most MDMs default to strings, some allow other data type to be specified). Correct syntax for OrgKey and AddonHost values. Correct MDM variable pointing to user identity. MDM provided an identity match the UPN provisioned with Netskope tenant. If a VPN profile is used for bringing in enrollment variables, ensure that it has On-Demand settings enabled in MDM configuration. Click the Netskope Client icon, export Netskope client logs and search in nsAppUI.log file for enrollment data received from MDM.",
  "content_length": 2475,
  "crawl_timestamp": 1750780637.534514
}