{
  "url": "https://docs.netskope.com/en/ticket-orchestrator-module",
  "title": "Ticket Orchestrator Module - Netskope Knowledge Portal",
  "content": "Ticket Orchestrator is designed to streamline the creation and management of tickets and/or notifications in 3rd-party ITSM or collaboration applications only as a result of a matching alert in the customer’s Netskope Security Cloud. Click play to learn how to set up Ticket Orchestrator. Ticket Orchestrator Global Settings Only admins can set the duration that data is held in Cloud Exchange. Once the maximum configured duration is exceeded, any tickets, notifications, and/or alerts will be removed from the Ticket Orchestrator module. Any notifications or tickets created in 3rd-party systems via plugins will NOT be modified. Only tickets can be selectively versus globally removed using the filter. If no tickets match the configured rule for deletion, nothing will be deleted, and these logs will continue to consume storage on the host system. Go to Settings > Ticket Orchestrator . Specify in the number of days how often you want to delete alerts, tickets, and notifications. Ticket Orchestrator maintains a database of tickets captured from configured plugins. To filter based on a rule or group, click Add rule or Add group , and then select the appropriate comparison operator And / Or by moving the mouse over the And button in the upper left, creating a multi-variable match. Retry tickets by selecting failed tickets on the Tickets page of the Ticket Orchestrator module, and then clicking the Retry image (arrows in a circle). Click Yes to confirm the action. Configure 3rd-party Ticket Orchestrator Plugins Update Configured Ticket Orchestrator Plugins List Alerts and Use Filter Options Manage Ticket Orchestrator Business Rules Mapping a Business Rule to a Workflow Queue List Tickets and Use Filter Options Ticket Orchestrator Custom Plugin Developers Guide",
  "content_length": 1779,
  "crawl_timestamp": 1750780383.022628
}