{
  "url": "https://docs.netskope.com/en/user-import-methods-and-supported-attributes/",
  "title": "User Import Methods and Supported Attributes - Netskope Knowledge Portal",
  "content": "The following are the supported methods to import users into your Netskope tenant. Manual Import Using SCIM App Using Directory Importer We do not support multiple, distinct import methods simultaneously updating the same enterprise user account ( Universal Principal Name (UPN) / username. Import Method Upn Email Id First Name, Last Name Groups Ou Custom Attributes Notes Manual Entries No Yes No No No No This option is recommended only when adding a small number of users manually. Bulk Upload via CSV file No Yes Yes No No No This option is recommended only when adding a small number of users manually. SCIM Yes(userName) Yes Yes Yes No No Recommended option for large size deployment. Directory Importer Yes Yes Yes Yes Yes Yes * Email ID and UPN is a mandatory field during user import. * Email ID is mandatory in all deployment modes because it represent the user identity across the Netskope Secure Cloud Platform. * UPN is mandatory for transparent deployment of Netskope Client and is highly recommended. Manual Entries or Bulk Upload In this method you can do single or bulk import of users manually via the Tenant UI or using a CSV file. To import users: Login to your tenant with admin credentials. Go to Settings > Security Cloud Platform > Users (under Netskope Client). In the users page, click Add Users to start adding users. In the Add Users pop-up box, you can either add user emails as comma separated values or upload a CSV file with user details. The CSV file must have data in the following format: email (required), last name (optional), and first name (optional) Using SCIM App System for Cross-domain Identity Management (SCIM) defines a standard for exchanging identity information across different cloud app vendors. The objects that are exchanged using SCIM are called resources (like user resource, group resource etc). The purpose of SCIM is to automate the exchange of user identity information across apps for user provisioning. For more information, see SCIM Settings for User Provisioning Netskope SCIM implementation follows the RFC 7643 & 7644 standards and support SCIM calls from IDPs that follows the same SCIM RFC standards. The following are the list of Netskope supported SCIM calls: Get Post Del Patch List all Users Get User by SCIM ID List all Groups Get Group by SCIM ID Create User Create Group Delete User Delete Group Add User to Group Remove User to Group Toggle Active To watch a video about Okta SCIM provisioning, click Play. https://fast.wistia.com/embed/medias/d00upur865.jsonp",
  "content_length": 2536,
  "crawl_timestamp": 1750780794.107477
}