{
  "url": "https://docs.netskope.com/en/upgrading-va-to-103-0-0-338",
  "title": "Upgrading VA to 103.0.0.338 - Netskope Knowledge Portal",
  "content": "Before upgrading the VA, make sure of the following: The current software version is 96.0.0 or 99.0.0. Run show version-info . The upgrade occurs during a maintenance window. The upgrade may take up to an hour and requires a reboot of your system(s). The size of the root partition is 64 GB or higher. For information on increasing the partition size, see Increase the Size of the Partition . There’s at least 16 GB of free space on the /opt/ns/upgrades partition where the upgrade pkg is downloaded. The log partition, /var/ns/docker/mounts/lclw/mountpoint must have at least 20 GB of free space. The urldbz package is installed on a DPoP appliance. You can verify this by running show version-info command. For instructions to install the urldbz package, see Upgrade the Additional Appliance Packages . Use the df command to check the available space on the upgrade and log partitions. If the output of the command shows high disk utilization, then you can delete the older version of the appliance by running the following command. upgrade software delete version <version number> Upgrade the Virtual Appliance Package Log in to the VA console and at the nsshell prompt, enter this command to check for the list of available software from Netskope. upgrade software list Enter this command to download the software: upgrade software download version 103.0.0.338 To check the status of the download, enter this command: upgrade software status download After the download is complete, enter this command to prepare the software package: upgrade software prepare version 103.0.0.338 To check the status of the prepare process, enter this command: upgrade software status prepare Status: SUCCESS is displayed when the prepare process is complete. Enter this command to install the new software package: upgrade software install version 103.0.0.338 To check the status of the install process, enter this command: upgrade software status install Status: SUCCESS is displayed when the install process is complete. Verify if the software is being upgraded to target version successfully. Run status all or show version-info command again to view software version. The UI shows the updated version of the software under Settings > Security Cloud Platform > On-Premises Infrastructure .",
  "content_length": 2280,
  "crawl_timestamp": 1750780829.631457
}