{
  "url": "https://docs.netskope.com/en/upgrade-a-publisher-for-prc-china/",
  "title": "Upgrade a Publisher for PRC (China) - Netskope Knowledge Portal",
  "content": "In the Publisher release R111, a new verification feature has been added for PRC (China) Publishers to verify the authenticity of the Publisher docker image being installed. For this feature to work, certain certificates need to be present in a specific path before the verification and upgrade occurs. Note If your China Publishers are below release v112, you must execute one of the following. There are two options to upgrade the Publisher: Option 1: Re-deploy the latest Publisher OVA VM Image Once the verified R111 ova image is installed, it will also install all the necessary certificates in the publisher vm which shall be used for subsequent upgrades with verification (such as R111 to R112). Refer to the Netskope Private Access Publisher Release Notes to get the OVA URL hosting on AliCloud. Option 2: Using automation on existing Publishers If you do not wish to re-deploy the complete Publisher VM through OVA, you can run a python based automation on your existing Publishers, which upgrades the Publisher docker image to the latest (R111) version, and also installs all the necessary certificates in the Publisher VM that will be used for subsequent upgrades with verification (such as R111 to R112). Note This option is only applicable for China (PRC) Publishers, and not to be used for rest of the world (ROW) Publishers. Use these steps to execute this automation. Retrieve the script from AliCloud. Execute this curl command to retrieve the script as verify_and_upgrade_publisher.py under the directory where the command is run. curl https://npa-ova.oss-cn-shenzhen.aliyuncs.com/publisher.netskope.com/latest/generic/verify_and_upgrade_publisher.py > verify_and_upgrade_publisher.py Verify the hash of the script. Execute this command in the same path where the script was downloaded, and verify whether the resulting SHA256 hash is same as: 0065bbe5f27fc7307a12ae100fe8c8bd079c7c365afbd4d4f9dee09bf789cdd6 . This step is important to make sure the verified Netskope provided automation is being executed on the Publisher VM. shasum -a 256 verify_and_upgrade_publisher.py Execute the automation to initiate upgrade with verification. Run this command in the terminal under the same path where the script was downloaded. sudo python3 verify_and_upgrade_publisher.py",
  "content_length": 2284,
  "crawl_timestamp": 1750781263.589611
}