{
  "url": "https://docs.netskope.com/en/upgrade-the-additional-appliance-packages",
  "title": "Upgrade the Additional Appliance Packages - Netskope Knowledge Portal",
  "content": "Appliance depends on additional packages to get the latest information on cloud apps and threat intelligence. These packages are automatically updated with every new release. You can also schedule upgrades to ensure that the packages are updated. The following additional packages are utilized by the appliance. Content – Contains API definitions for Cloud apps. The content package is updated automatically with new and updated cloud apps. This package is utilized by the OPLP and DPoP appliances. Threat-feed – Contains the various sources that provide Netskope with the latest threat intelligence. The threat feed package is updated automatically as part of Threat Protection, which is a licensed feature. The appliance hosts a small-scale threat feed package. The database is updated every two weeks and the packages encompasses the most recent malicious URLs and domains, excluding NOD, NRD, and DGA domains. This package is utilized by the OPLP and DPoP appliances. Urldb – Contains website categorizations as defined by Netskope Secure Web Gateway. The urldb package is updated automatically as part of Netskope Secure Web Gateway which is a licensed feature. This package is utilized by the DPoP appliance in any R103 or later release. Note After November 15, 2023, the urldbz package will no longer be provided . You must use the urldb package for the website categorization service for real-time protection policy match. You can also schedule the auto-upgrade for these packages. We recommend that you schedule the auto-upgrade of packages as explained in the next section. The upgrade procedure for the content and threat feed packages are the same except for specific code strings for each within the commands. To upgrade the packages on the appliance, at the Netskope shell prompt: Check for the list of available software from Netskope. The output shows the software available for upgrade and any versions that has been previously downloaded on the appliance. To do this, enter these commands: upgrade content list threat-feed list upgrade urldb list This gets the response: netskopesf> upgrade content list Available for download: 56.1.0.94 or netskopesf> upgrade threat-feed list Available for download: 1.1052 Note If a package version shows “Not installed”, then the feature that utilizes this package has not been enabled. Contact Netskope Support to get the required licenses. Download the version to upgrade by entering one of these commands: upgrade content download version <version number> or upgrade threat-feed download version <version number> The response shows the status after the software is downloaded: netskopesf> upgrade content download version 56.1.0.94 successfully downloaded 56.1.0.94. or netskopesf> upgrade threat-feed download version 1.1052 successfully downloaded 1.1052. After the download is complete, enter this command to prepare the software package: upgrade content prepare version <version number> or upgrade threat-feed prepare version <version number> To check the status of the prepare process, enter this command: upgrade content status prepare or upgrade threat-feed status prepare Status: SUCCESS is displayed when the prepare process is complete. Enter this command to install the new software package. upgrade content install version <version number> or upgrade threat-feed install version <version number> This gets the response: netskopesf> upgrade content install version 56.1.0.94 or netskopesf> upgrade threat-feed install version 1.1052 The upgrade will run in the background. Please use the status command to view install related messages. Note This process will take few minutes to complete the upgrade. Currently there is no notification sent on completion of the upgrade but you can verify the upgrade by checking the version of the software. To verify the version of packages installed, enter the command: show version-info You can also see the updated version of the software on the Settings > Security Cloud Platform > On-Premises Infrastructure page. Note Netskope recommends scheduling auto-upgrades to ensure that you always have the lastest Netskope products. To learn more, see Schedule Auto-Upgrade for the Content and Threat Feed Packages .",
  "content_length": 4219,
  "crawl_timestamp": 1750780910.6349728
}