{
  "url": "https://docs.netskope.com/en/virtual-appliance-release-notes/",
  "title": "Virtual Appliance Release Notes - Netskope Knowledge Portal",
  "content": "The Virtual Appliance provides a footprint as part of the CASB solution inside an enterprise’s perimeter. Get all latest updates such as new features, enhancements, known issues, and fixed issues for Netskope’s on-premises Cloud Access Security Broker (CASB). Virtual Appliance Release Notes Version 124.0.0.125 Release Date: May 27, 2025 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 121.0.0 Release Date: December 9, 2024 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 117.0.0 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 113.0.0 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 110.0.0 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 106.0.0.379 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 103.0.0.338 This release provides several improvements for Netskope’s Virtual Appliance, such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 99.0.0 This release provides several improvements for Netskope’s on-premises Cloud Access Security Broker (CASB), such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 96.0.0 This release provides several improvements for Netskope’s on-premises Cloud Access Security Broker (CASB), such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 93.1.0 This release provides several improvements for Netskope’s on-premises Cloud Access Security Broker (CASB), such as new features, enhancements, known issues, and fixed issues. Virtual Appliance Release Notes Version 93.0.0 This release provides several improvements for Netskope’s on-premises Cloud Access Security Broker (CASB), such as new features, enhancements, known issues, and fixed issues. Document Version: 1.0 Software Version: 93.0.0 General Availability Date: October, 2022 Virtual Appliance Release Notes Version 77.6.0 Copyright Statement Copyright 2021 Netskope Inc. All rights reserved. The information contained in this document is CONFIDENTIAL and PROPRIETARY in nature, and subject to the rights and ownership of Netskope. Any and all unauthorized copying or use of the contents hereof is prohibited. The Netskope logo and experience are trademarks of Netskope Inc. All other brand or product names are or may be trademarks or registered trademarks of their respective owners. Document Information Document Version: 2.0 Software Version: 77.6.0 Release Date: October 2021 Company Information Netskope 2445 Augustine Dr., 3rd floor Santa Clara, CA 95054 USA phone: 800.979.6988 Virtual Appliance Release Notes Version 77.5.0 Copyright Statement Copyright 2021 Netskope Inc. All rights reserved. The information contained in this document is CONFIDENTIAL and PROPRIETARY in nature, and subject to the rights and ownership of Netskope. Any and all unauthorized copying or use of the contents hereof is prohibited. The Netskope logo and experience are trademarks of Netskope Inc. All other brand or product names are or may be trademarks or registered trademarks of their respective owners. Document Information Document Version: 2.0 Software Version: 77.5.0 Release Date: September 2021 Company Information Netskope 2445 Augustine Dr., 3rd floor Santa Clara, CA 95054 USA phone: 800.979.6988",
  "content_length": 4078,
  "crawl_timestamp": 1750780861.35435
}